# 1. Introduction to MySQL
- MySQL is a very popular open-source relational database management system (RDBMS).

- What is MySQL?
    - MySQL is a relational database management system
    - MySQL is open-source
    - MySQL is free
    - MySQL is ideal for both small and large applications
    - MySQL is very fast, reliable, scalable, and easy to use
    - MySQL is cross-platform
    - MySQL is compliant with the ANSI SQL standard
    - MySQL was first released in 1995
    - MySQL is developed, distributed, and supported by Oracle Corporation
    - MySQL is named after co-founder Monty Widenius's daughter: My
- MySQL is written in C and C++, and its SQL parser is written in yacc.
- SQL is known as the standard query language. It is used to interact with the database like MySQL. MySQL is a database that stores various types of data and keeps it safe.
    - A PHP/Python script is required to store and retrieve the values inside the database.
    - SQL is a computer language, whereas MySQL is a software or an application
    - SQL is used for the creation of database management systems whereas MySQL is used to enable data handling, storing, deleting and modifying data
- A database is a collection of organized data and features used to access them, whereas the table is a collection of rows and columns used to store the data.

## 1.2 Who Uses MySQL?
- Huge websites like Facebook, Twitter, Airbnb, Booking.com, Uber, GitHub, YouTube, etc.
- Content Management Systems like WordPress, Drupal, Joomla!, Contao, etc.
- A very large number of web developers around the world

## 1.3 Show Data On Your Web Site
- To build a web site that shows data from a database, you will need:
    - An RDBMS database program (like MySQL)
    - A server-side scripting language, like PHP
    - To use SQL to get the data you want
    - To use HTML / CSS to style the page
    
## 1.4 MySQL RDBMS
- RDBMS stands for Relational Database Management System.
- RDBMS is a program used to maintain a relational database.
- RDBMS is the basis for all modern database systems such as MySQL, Microsoft SQL Server, Oracle, and Microsoft Access.
- RDBMS uses SQL queries to access the data in the database.

## 1.5 What is a Database Table?
- A table is a collection of related data entries, and it consists of columns and rows.
- Rows and columns; Records and Fields; Observations and Variables
- A column holds specific information about every record in the table.
- A record (or row) is each individual entry that exists in a table.

## 1.6 What is a Relational Database?
- A relational database defines database relationships in the form of tables. The tables are related to each other - based on data common to each.
- for example: three tables "Customers", "Orders", and "Shippers" from the Northwind database are related by column "customerID" and "shipperID"
    - Tables "Customers", and "Orders" are related by "customerID"
    - Tables "Orders", and "Shippers" are related by "shipperID"

## 1.7 Micelleneous
1. What is MySQL?
    - MySQL is an open source DBMS which is built, supported and distributed by MySQL AB (now acquired by Oracle)
2. What are the technical features of MySQL? 
    - MySQL database software is a client or server system which includes
        - Multithreaded SQL server supporting various client programs and libraries
        - Different backend
        - Wide range of application programming interfaces and Administrative tools.
3. Why MySQL is used?
    - MySQL database server is reliable, fast and very easy to use.  This software can be downloaded as freeware and can be downloaded from the internet.
    
4. What are Heap tables?
    - HEAP tables are present in memory and they are used for high speed storage on temporary basis.
    - BLOB or TEXT fields are not allowed
    - Only comparison operators can be used =, <,>, = >,=<
    - AUTO_INCREMENT is not supported by HEAP tables
    - Indexes should be NOT NULL
    
5. What is the default port for MySQL Server?
    - The default port for MySQL server is 3306.
6.  What are the advantages of MySQL when compared with Oracle? 
    - MySQL is open source software which is available at any time and has no cost involved.
    - MySQL is portable
    - GUI with command prompt.
    - Administration is supported using MySQL Query Browser
    
7. Differentiate between FLOAT and DOUBLE? 
    - Following are differences for FLOAT and DOUBLE:
        - Floating point numbers are stored in FLOAT with eight place accuracy and it has four bytes.
        - Floating point numbers are stored in DOUBLE with accuracy of 18 places and it has eight bytes.
8. Differentiate CHAR_LENGTH and LENGTH?
    - CHAR_LENGTH  is character count whereas the LENGTH is byte count. The numbers are same for Latin characters but they are different for Unicode and other encodings.
9. How to represent ENUMs and SETs internally? 
    - ENUMs and SETs are used to represent powers of two because of storage optimizations.
10. What is the usage of ENUMs in MySQL?
    - ENUM is a string object used to specify set of predefined values and that can be used during table creation.
    - Create table size(name ENUM('Small', 'Medium','Large');
    
11. Define REGEXP? 
    - REGEXP is a pattern match in which  matches pattern anywhere in the search value.
12. Difference between CHAR and VARCHAR? 
    - Following are the differences between CHAR and VARCHAR:
        - CHAR and VARCHAR types differ in storage and retrieval
        - CHAR column length is fixed to the length that is declared while creating table. The length value ranges from 1 and 255
        - When CHAR values are stored then they are right padded using spaces to specific length. Trailing spaces are removed when CHAR values are retrieved.
        
13. Give string types available for column?
    - The string types are:

            SET
            BLOB
            ENUM
            CHAR
            TEXT
            VARCHAR
            
14. How to get current MySQL version?
    - The following is used to get the current version of MySQL.

            SELECT VERSION ();
            SHOW VARIABLES LIKE "%version%";
15. What storage engines are used in MySQL? 
    - Storage engines are called table types and data is stored in files using various techniques.
    - Technique involves:

            Storage mechanism
            Locking levels
            Indexing
            Capabilities and functions.
16. What are the drivers in MySQL?
    - Following are the drivers available in MySQL:

            PHP Driver
            JDBC Driver
            ODBC Driver
            C WRAPPER
            PYTHON Driver
            PERL Driver
            RUBY Driver
            CAP11PHP Driver
            Ado.net5.mxj
17. What does a TIMESTAMP do on **UPDATE CURRENT_TIMESTAMP** data type?
    - TIMESTAMP column is updated with Zero when the table is created.  UPDATE CURRENT_TIMESTAMP modifier updates the timestamp field to  current time whenever there is a change in other fields of the table.        
18. What is the difference between primary key and candidate key?
    - Every row of a table is identified uniquely by primary key. There is only one primary key for a table.
    - Primary Key is also a candidate key. By common convention, candidate key can be designated as primary and which can be used for any foreign key references.
19. How do you login to MySql using Unix shell?
    - We can login through this command:

            # [mysql dir]/bin/mysql -h hostname -u <UserName> -p <password>
20. What does myisamchk do?
    - It compress the MyISAM tables, which reduces their disk or memory usage.

21. How do you control the max size of a HEAP table?
    - Maximum size of Heal table can be controlled by MySQL config variable called max_heap_table_size.
22. What is the difference between MyISAM Static and MyISAM Dynamic?
    - In MyISAM static all the fields will have fixed width. The Dynamic MyISAM table will have fields like TEXT, BLOB, etc. to accommodate the data types with various lengths.
    - MyISAM Static would be easier to restore in case of corruption. 
    
23. What are federated tables?
    - Federated tables which allow access to the tables located on other databases on other servers.    
24. What, if a table has one column defined as TIMESTAMP?
    - Timestamp field gets the current timestamp whenever the row gets altered.    
    
25. What happens when the column is set to AUTO INCREMENT and if you reach maximum value in the table?
    - It stops incrementing. Any further inserts are going to produce an error, since the key has been used already. 
26. How can we find out which auto increment was assigned on Last insert?
    - LAST_INSERT_ID will return the last value assigned by Auto_increment and it is not required to specify the table name.

27. How can you see all indexes defined for a table?
    - Indexes are defined for the table by:

            SHOW INDEX FROM <tablename>;   
28. What do you mean by % and _ in the LIKE statement?
    - % corresponds to 0 or more characters, _ is exactly one character in the LIKE statement.
    
29. How can we convert between Unix & MySQL timestamps?
    - **UNIX_TIMESTAMP** is the command which converts from MySQL timestamp to Unix timestamp
    - **FROM_UNIXTIME** is the command which converts from Unix timestamp to MySQL timestamp.
    
30. What are the column comparisons operators?
    - The = , <>, <=, <, >=, >,<<,>>, <=>, AND, OR, or LIKE operators are used in column comparisons in SELECT statements.

 31. How can we get the number of rows affected by query?
    - Number of rows can be obtained by

          SELECT COUNT (user_id) FROM users;
32.  Is Mysql query is case sensitive?
    - No. All the following examples are same. It is not case sensitive.

            SELECT VERSION(), CURRENT_DATE;
            SeLect version(), current_date;
            seleCt vErSiOn(), current_DATE;        
33. What is the difference between the LIKE and REGEXP operators?  
    - LIKE and REGEXP operators are used to express with ^ and %.
    - Caret vs percent
    
            SELECT * FROM employee WHERE emp_name REGEXP "^b";
            SELECT * FROM employee WHERE emp_name LIKE "%b";       
        
34. What is the difference between BLOB AND TEXT?
    - A BLOB is a binary large object that can hold a variable amount of data. There are four types of BLOB –

            TINYBLOB
            BLOB
            MEDIUMBLOB and
            LONGBLOB
    - They all differ only in the maximum length of the values they can hold.

    - A TEXT is a case-insensitive BLOB. The four TEXT types

            TINYTEXT
            TEXT
            MEDIUMTEXT and
            LONGTEXT
    - They all correspond to the four BLOB types and have the same maximum lengths and storage requirements.
    - The only difference between BLOB and TEXT types is that sorting and comparison is performed in case-sensitive for BLOB values and case-insensitive for TEXT values.        
        
35. What is the difference between mysql_fetch_array and mysql_fetch_object?
    - mysql_fetch_array() -Returns a result row as an associated array or a regular array from database.
    - mysql_fetch_object –  Returns a result row as object from database.

36. How can we run batch mode in mysql?
    - Following commands are used to run in batch mode:

            mysql ;
            mysql mysql.out        
        
37. Where MyISAM table will be stored and also give their formats of storage?
    - Each MyISAM table is stored on disk in three formats:
        - The ‘.frm’ file stores the table definition
        - The data file has a ‘.MYD’ (MYData) extension
        - The index file has a ‘.MYI’ (MYIndex) extension
        
38. What are the different tables present in MySQL?
    - Total 5 types of tables are present:

            MyISAM
            Heap
            Merge
            INNO DB
            ISAM
    - MyISAM is the default storage engine as of MySQL .        
39. What is ISAM?
    - ISAM  is abbreviated as Indexed Sequential Access Method.It was developed by IBM to store and retrieve data on secondary storage systems like tapes.

40. What is InnoDB?
    - lnnoDB is a transaction safe storage engine developed by Innobase Oy which is a Oracle Corporation now.

41. How MySQL Optimizes DISTINCT?
    - DISTINCT is converted to a GROUP BY on all columns and it will be combined with ORDER BY clause.

            SELECT DISTINCT t1.a FROM t1,t2 where t1.a=t2.a;  
            
42. How to enter Characters as HEX Numbers?
    - If you want to enter characters as HEX numbers, you can enter HEX numbers with single quotes and a prefix of (X), or just prefix HEX numbers with (Ox).
    - A HEX number string will be automatically converted into a character string, if the expression context is a string.

43. How to display top 50 rows?
    - In MySql, top 50 rows are displayed by using this following query:

            SELECT * FROM
            LIMIT 0,50;
            
44. How many columns can be used for creating Index?
    - Maximum of 16 indexed columns can be created for any standard table.

45. What is the different between NOW() and CURRENT_DATE()?
    - NOW () command is used to show current year,month,date with hours,minutes and seconds.
    - CURRENT_DATE() shows current year,month and date only.
    
            mysql> SELECT VERSION(), CURRENT_DATE, NOW();
            +-------------------------+--------------+---------------------+
            | VERSION()               | CURRENT_DATE | NOW()               |
            +-------------------------+--------------+---------------------+
            | 5.7.34-0ubuntu0.18.04.1 | 2021-11-27   | 2021-11-27 15:14:00 |
            +-------------------------+--------------+---------------------+
            
46. What are the objects can be created using CREATE statement?
    - Following objects are created using CREATE statement:

            DATABASE
            EVENT
            FUNCTION
            INDEX
            PROCEDURE
            TABLE
            TRIGGER
            USER
            VIEW
47. How many TRIGGERS are allowed in MySql table?
    - SIX triggers are allowed in MySql table. They are as follows:

            BEFORE INSERT
            AFTER INSERT
            BEFORE UPDATE
            AFTER UPDATE
            BEFORE DELETE and
            AFTER DELETE            
48. What are the nonstandard string types?
    - Following are Non-Standard string types:

            TINYTEXT
            TEXT
            MEDIUMTEXT
            LONGTEXT            
49. What are all the Common SQL Function?
    - CONCAT(A, B) – Concatenates two string values to create a single string output. Often used to combine two or more fields into one single field.
    - FORMAT(X, D) – Formats the number X to D significant digits.
    - CURRDATE(), CURRTIME() – Returns the current date or time.
    
            SELECT VERSION(), CURRENT_DATE, NOW(), current_time;

    - NOW() – Returns the current date and time as one value.
    - MONTH(), DAY(), YEAR(), WEEK(), WEEKDAY() – Extracts the given data from a date value.
    - HOUR(), MINUTE(), SECOND() – Extracts the given data from a time value.
    - DATEDIFF(A, B) – Determines the difference between two dates and it is commonly used to calculate age
    
            Select DATEDIFF("2021-11-27", "2021-10-27");
            Select DATEDIFF("2021-11-27 15:19:27","2021-10-12 10:21:45");
    - SUBTIMES(A, B) – Determines the difference between two times.
    - FROMDAYS(INT) – Converts an integer number of days into a date value.
    
50. Explain Access Control Lists.
    - An ACL (Access Control List) is a list of permissions that is associated with an object. This list is the basis for MySQL server’s security model and it helps in troubleshooting problems like users not being able to connect.
    - MySQL keeps the ACLs (also called grant tables) cached in memory. When a user tries to authenticate or run a command, MySQL checks the authentication information and permissions against the ACLs, in a predetermined order.
    
51. Exporting a MySQL or MariaDB Database

        mysqldump -u username -p database_name > data-dump.sql
     - username is the username you can log in to the database with
    - database_name is the name of the database to export
    - data-dump.sql is the file in the current directory that stores the output.
    - The command will produce no visual output, but you can inspect the contents of data-dump.sql to check if it’s a legitimate SQL dump file.
    - Run the following command:
    
            head -n 5 data-dump.sql
     
52. Step 2 — Importing a MySQL or MariaDB Database
    - To import an existing dump file into MySQL or MariaDB, you will have to create a new database. This database will hold the imported data.
    - First, log in to MySQL as root or another user with sufficient privileges to create new databases:

            mysql -u root -p
            CREATE DATABASE new_database;
            mysql -u username -p new_database < data-dump.sql
            
53. Add a new column?

        ALTER TABLE table_name     
            ADD COLUMN column_name column_definition [FIRST|AFTER existing_column]; 
            
54. Add a foreign key?

        [CONSTRAINT constraint_name]    
            FOREIGN KEY [foreign_key_name] (col_name, ...)    
            REFERENCES parent_tbl_name (col_name,...) 
            
55. Rename a table?

        mysql> RENAME old_table TO new_table;   
56. Delete a column?

        ALTER TABLE table_name DROP COLUMN column_name1, column_name2....;  
        
57. Delete a row?

        DELETE FROM table_name WHERE Condition_specified;    
58. Drop primary key?

        ALTER TABLE table_name  DROP PRIMARY KEY;

59. Create A VIEW?

            CREATE [OR REPLACE] VIEW view_name AS    
            SELECT columns    
            FROM tables    
            [WHERE conditions]; 
            
60. How to create a Trigger in MySQL?
    - A trigger is a procedural code in a database that automatically invokes whenever certain events on a particular table or view in the database occur. It can be executed when records are inserted into a table, or any columns are being updated. We can create a trigger in MySQL using the syntax as follows:

            CREATE TRIGGER trigger_name    
                [before | after]    
               {insert | update | delete}    
                ON table_name [FOR EACH ROW]    
                BEGIN    
                    --variable declarations    
                    --trigger code    
                END; 
61. How to clear screen in MySQL?

        mysql> SYSTEM CLS; 
62. Create new user?

        CREATE USER [IF NOT EXISTS] account_name IDENTIFIED BY 'password';   
63. Check users in mysql?

        mysql> SELECT USER FROM mysql.user;   
                
64. Import CSV?

        LOAD DATA INFILE 'C:/ProgramData/MySQL/MySQL Server 8.0/Uploads/filename.csv' 
        INTO TABLE tablename     
        FIELDS TERMINATED BY ','    
        OPTIONALLY ENCLOSED BY '"'    
        LINES TERMINATED BY '\r\n'     
        IGNORE 1 ROWS;    
65. Insert Date in MySQL?

        INSERT INTO table_name (column_name, column_date) VALUES ('DATE: Manual Date', '2008-7-04');                   
                
66. Database size?

        SELECT table_schema AS 'alemdb', 
        SUM(data_length + index_length) 'Size in Bytes',  
        ROUND(SUM(data_length + index_length) / 1024 / 1024, 2) 'Size in MB'  
        FROM information_schema.tables  
        WHERE table_schema = 'testdb'  
        GROUP BY table_schema; 
        
67. Second highest salary?

        SELECT salary   
        FROM (SELECT salary 
              FROM employees 
              ORDER BY salary DESC LIMIT 2) AS   Emp ORDER BY salary LIMIT 1; 
              
        select amount  
        from  (select amount 
               from payments 
               order by amount DESC 
               limit 2) AS sa 
        order by amount ASC limit 1;
        
        
        select max(amount) 
        from payments 
        where amount < (select max(amount)
                        from amount);
                        
68. Second minimum?

        select min(amount) 
        from payments 
        where amount >(select  min(amount) 
                       from payments);
                       
69. How many Triggers are possible in MySQL?
- There are only six Triggers allowed to use in the MySQL database.

        Before Insert
        After Insert
        Before Update
        After Update
        Before Delete
        After Delete
        
70. What is the heap table?
    - Tables that are present in memory is known as HEAP tables. When you create a heap table in MySQL, you should need to specify the TYPE as HEAP. These tables are commonly known as memory tables. They are used for high-speed storage on a temporary basis. They do not allow BLOB or TEXT fields.

# 2. Python MySQL
    
## 2.1 Background Inforamtion
- Python can be used in database applications.
- One of the most popular databases is MySQL.
- To be able to experiment with it, you should have MySQL installed on your computer.
- You can download a free MySQL database at https://www.mysql.com/downloads/.
- **Install MySQL Driver**
    - Python needs a MySQL driver to access the MySQL database.
- In this tutorial we will use the driver "MySQL Connector".
- We recommend that you use PIP to install "MySQL Connector".
- PIP is most likely already installed in your Python environment.
- Navigate your command line to the location of PIP, and type the following:
     
         !pip install mysql-connector-python
         !pip install pymysql
         sudo service mysql start/stop
         mysql -h host -u alem -p brookx150
- ------------------
     
         CREATE DATABASE alemdb;
         USE alemdb;
         CREATE USER 'Alem'@'localhost' IDENTIFIED BY 'brookx150';
         GRANT ALL ON alemdb.* TO 'Alem'@'localhost';
         GRANT SELECT ON alemdb.invoice TO 'Alem'@'localhost';
         GRANT USAGE ON *.* TO 'Alem'@'localhost' WITH MAX_QUERIES_PER_HOUR 1000;
         
- --------------
        
        mysql> SHOW DATABASES;
        mysql> SHOW SCHEMAS;
        SHOW DATABASES LIKE pattern;
        SHOW DATABASES LIKE 'open%';
        \c --> clear on mysql terminal
- ----------------------

- A common use of mysqldump is for making a backup of an entire database:

        mysqldump db_name > backup-file.sql
- You can load the dump file back into the server like this:
    - Unix

            mysql db_name < backup-file.sql
    - The same in the Windows command prompt:

            mysql -p -u [user] [database] < backup-file.sql
    - PowerShell

            cmd.exe /c "mysql -u root -p db_name < backup-file.sql"
    - MySQL command line

            mysql> use db_name;
            mysql> source backup-file.sql;
            mysql> SET autocommit=0 ; source the_sql_file.sql ; COMMIT ;
 
 ----------------------------
 - Delete/Drop a Database from mysql server
 
         DROP DATABASE database_name;
         
 - --------------
 - Location of mysql in ubuntu
 
         sudo grep -r datadir /etc/mysql/

- -----------------
- Geany

        Use it for opening *.sql files on ubuntu
        
- ---------------
- Check columns

        SHOW COLUMNS FROM City
        show columns from employees from alemdb;
        
- -------------
- Show port that mysql is listening

        mysql> show variables where variable_name in ('hostname','port');
        
- -------------
- MySQL Version Check

           $ mysql -V  
           mysql> SELECT VERSION ();

## 2.2 Test MySQL Connector
- To test if the installation was successful, or if you already have "MySQL Connector" installed, create a Python page with the following content:
    - demo_mysql_test.py:
          
          import mysql.connector
    - If the above code was executed with no errors, "MySQL Connector" is installed and ready to be used.

In [115]:
er4

    
## 2.3 Create Connection
https://dev.mysql.com/doc/connector-python/en/connector-python-example-connecting.html
- Start by creating a connection to the database.
- Use the username and password from your MySQL database:

In [1]:
import mysql.connector
from mysql.connector import errorcode
import sys

In [4]:
#!/usr/bin/python
import mysql.connector
from mysql.connector import errorcode
import sys
try:
    mydb = mysql.connector.connect(
      host="localhost",           # your host, usually localhost
      user="Alem",                # your username
      password="brookx150",       # your password
      db="alemdb"                 # name of the data base
    )
except:
    print(f"Err:{sys.exc_info()[0]}")
else:
    print(f"Successfully connected to {mydb}")

Err:<class 'mysql.connector.errors.ProgrammingError'>

In [136]:
import mysql.connector
from mysql.connector import errorcode

try:
    cnx = mysql.connector.connect(
          host="localhost",
          user='Alem',
          password="brookx150",
          database='alemdb')
except mysql.connector.Error as err:
    if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Something is wrong with your user name or password")
    elif err.errno == errorcode.ER_BAD_DB_ERROR:
        print("Database does not exist")
    else:
        print(err)        
else:
    print(f"Successfully connected to {cnx}") 
    cnx.close()

Successfully connected to <mysql.connector.connection_cext.CMySQLConnection object at 0x7f109b9f3fd0>

In [137]:
def connect_db():
    try:
        mydb = mysql.connector.connect(
          host="localhost",
          user='Alem',
          password="brookx150",
          database='alemdb')
    except mysql.connector.Error as err:
        if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
            print("Something is wrong with your user name or password")
        elif err.errno == errorcode.ER_BAD_DB_ERROR:
            print("Database does not exist")
        else:
            print(err)        
    else:
        print(f"Successfully connected to {mydb}") 
        mydb.close()

In [138]:
connect_db()

Successfully connected to <mysql.connector.connection_cext.CMySQLConnection object at 0x7f109b8f35d0>

## 2.4 Creating a DB
### Create a DB
- To create a database in MySQL, use the "CREATE DATABASE" statement:

In [139]:
mycursor = mydb.cursor(buffered=True)
#mycursor.execute("CREATE DATABASE msqldb")

- In stead of the above python code, use the following SQL statement to create a DB on mysql terminal.
    
        CREATE DATABASE alemdb;

### Check if Database Exists
- You can check if a database exist by listing all databases in your system by using the "SHOW DATABASES" statement:

In [140]:
mycursor1 = mydb.cursor(buffered=True)
mycursor1.execute("SHOW DATABASES")
print(type(mycursor1))
db_lst = [db[0] for db in mycursor1]
db_lst

<class 'mysql.connector.cursor_cext.CMySQLCursorBuffered'>

['information_schema', 'alemdb']

In [120]:
('alemdb',)[0]

'alemdb'

https://www.w3schools.com/python/python_mysql_create_table.asp
https://www.w3schools.com/mySQl/mysql_select.asp

https://dev.mysql.com/doc/connector-python/en/connector-python-example-ddl.html

## 2.6 Creating a Table
### Create a Table
- To create a table in MySQL, use the "CREATE TABLE" statement.
- Make sure you define the name of the database when you create the connection

        mycursor = mydb.cursor()
        mycursor.execute("""CREATE TABLE film(
             film_id int4,
             title varchar(255),
             description text,
             release_year ,
             return_date datetime,
             staff_id int2,
             last_update datetime
                )
            """)

<img src="./figs/mysqlsdb.png">

            mysql> use alemdb;
            mysql> source /home/alem/0_Alem/alemprojects/FinalNotes/2_DBNotes/1_MySQL/alemdb.sql;
            mysql> SET autocommit=0 ; source /home/alem/0_Alem/alemprojects/FinalNotes/2_DBNotes/1_MySQL/alemdb.sql; COMMIT ;
            
            mysql -u Alem –-password=brookx150 alemdb < /home/alem/0_Alem/alemprojects/FinalNotes/2_DBNotes/1_MySQL/alemdb.sql

In [ ]:
table = """CREATE TABLE alem (
  name varchar(15) NOT NULL,
  age int,
  code int4,
  PRIMARY KEY (code)
) """
mycursor2 = mydb.cursor(buffered=True)
mycursor2.execute(table)

sql = "INSERT INTO alem (name, age, code) VALUES (%s, %s, %s)"
val = ("Alem", 40, 1981)
mycursor2.execute(sql, val)
mydb.commit()
print(mycursor.rowcount, "record inserted.")
print("1 record inserted, ID:", mycursor2.lastrowid)

### Check if Table Exists
- You can check if a table exist by listing all tables in your database with the "SHOW TABLES" statement:

    table1 IN list_tables;

In [142]:
mycursor3 = mydb.cursor(buffered=True)
mycursor3.execute("SHOW TABLES")
for x in mycursor3:
    print(x)

('alem',)
('customers',)
('employees',)
('offices',)
('orderdetails',)
('orders',)
('payments',)
('productlines',)
('products',)

### Primary Key
- When creating a table, you should also create a column with a unique key for each record.
- This can be done by defining a PRIMARY KEY.
- We use the statement "INT AUTO_INCREMENT PRIMARY KEY" which will insert a unique number for each record. Starting at 1, and increased by one for each record.


        mycursor = mydb.cursor()

        mycursor.execute("CREATE TABLE customers (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")
        
        mycursor = mydb.cursor()
        mycursor.execute("ALTER TABLE customers ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

## 2.7 Insert Table

<img src = "./figs/insert.png">

### Insert Into Table
- To fill a table in MySQL, use the "INSERT INTO" statement.

            mycursor = mydb.cursor()

            sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
            val = ("John", "Highway 21")
            mycursor.execute(sql, val)

            mydb.commit()

            print(mycursor.rowcount, "record inserted.")
            print("1 record inserted, ID:", mycursor.lastrowid) --> Get Inserted ID
            
- Important!: Notice the statement: **mydb.commit()**. It is required to make the changes, otherwise no changes are made to the table.


### Insert Multiple Rows
- To insert multiple rows into a table, use the **executemany()** method.
- The second parameter of the executemany() method is a list of tuples, containing the data you want to insert:

            mycursor = mydb.cursor()

            sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
            val = [
                      ('Peter', 'Lowstreet 4'),
                      ('Amy', 'Apple st 652'),
                      ('Hannah', 'Mountain 21'),
                      ('Michael', 'Valley 345'),
                      ('Sandy', 'Ocean blvd 2'),
                      ('Betty', 'Green Grass 1'),
                      ('Richard', 'Sky st 331'),
                      ('Susan', 'One way 98'),
                      ('Vicky', 'Yellow Garden 2'),
                      ('Ben', 'Park Lane 38'),
                      ('William', 'Central st 954'),
                      ('Chuck', 'Main Road 989'),
                      ('Viola', 'Sideway 1633')
                    ]

            mycursor.executemany(sql, val)

            mydb.commit()

            print(mycursor.rowcount, "was inserted.")

## 2.8 Select From a Table

<img src ="./figs/select.png">

- To select from a table in MySQL, use the "SELECT" statement:
    - Before moving further, Please make sure you have the following in place: –
        - Username and password to connect MySQL
        - MySQL table name from which you want to select data.

https://pynative.com/python-mysql-select-query-to-fetch-data/

In [10]:
import pandas as pd
import mysql.connector
from mysql.connector import errorcode

try:
    cnx2 = mysql.connector.connect(
          host="localhost",
          user='Alem',
          password="brookx150",
          database='alemdb')
except mysql.connector.Error as err:
    if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Something is wrong with your user name or password")
    elif err.errno == errorcode.ER_BAD_DB_ERROR:
        print("Database does not exist")
    else:
        print(err)        
else:
    print(f"Successfully connected to {cnx2}") 
    cnx2.close()

Successfully connected to <mysql.connector.connection_cext.CMySQLConnection object at 0x7f29c6ad9190>

In [11]:
mycursor4 = mydb.cursor(buffered=True)
mycursor4.execute("SELECT * FROM customers LIMIT 3")
myresult = mycursor4.fetchall()
for x in myresult:
    print(x)

(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, Decimal('21000.00'))
(112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 'USA', 1166, Decimal('71800.00'))
(114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 'Australia', 1611, Decimal('117300.00'))

In [12]:
df = pd.DataFrame(myresult)
df

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166,71800.00
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611,117300.00

In [13]:
from sqlalchemy import create_engine
import pandas as pd

db_connection_str = 'mysql+pymysql://Alem:brookx150@localhost/alemdb'
db_connection = create_engine(db_connection_str)
df = pd.read_sql('SELECT * FROM customers', con=db_connection)
df.head()
#db_connection.close()

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.0
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166.0,71800.0
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611.0,117300.0
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",None,Nantes,None,44000,France,1370.0,118200.0
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,None,Stavern,None,4110,Norway,1504.0,81700.0

In [14]:
from sqlalchemy import create_engine
import pandas as pd

db_connection_str = 'mysql+pymysql://Alem:brookx150@localhost/alemdb'
db_connection = create_engine(db_connection_str)
qry =  "SELECT * FROM customers WHERE city IN (SELECT city FROM customers WHERE city IN ('Nantes', 'Las Vegas')) ORDER BY contactFirstName ASC LIMIT 2"
df = pd.read_sql(qry, con=db_connection)
df.head()
#db_connection.close()

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370,21000.0
1,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",None,Nantes,None,44000,France,1370,118200.0

In [15]:
df['addressLine1'].tolist()

['54, rue Royale', '67, rue des Cinquante Otages']

### Accesing only a single row using fetchone() method

In [16]:
mycursor5 = mydb.cursor(buffered=True)
mycursor5.execute("SELECT * FROM customers")
myresult5 = mycursor5.fetchone()
print(myresult5)

(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, Decimal('21000.00'))

## 2.9 MySQL Where

In [17]:
mycursor6 = mydb.cursor(buffered=True)

In [18]:
sql = "SELECT * FROM customers WHERE city = 'Nantes'"
mycursor6.execute(sql)
myresult6 = mycursor6.fetchall()
for x in myresult6:
    print(x)

(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, Decimal('21000.00'))
(119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 'France', 1370, Decimal('118200.00'))

### Prevent SQL Injection
- When query values are provided by the user, you should escape the values.
- This is to prevent SQL injections, which is a common web hacking technique to destroy or misuse your database.
- The mysql.connector module has methods to escape query values:
    - Parametrized queries: Parameterized queries are a means of pre-compiling an SQL statement so that you can then supply the parameters in order for the statement to be executed. This method makes it possible for the database to recognize the code and distinguish it from input data. The user input is automatically quoted and the supplied input will not cause the change of the intent, so this coding style helps mitigate an SQL injection attack.
    - Input validation: The validation process is aimed at verifying whether or not the type of input submitted by a user is allowed. Input validation makes sure it is the accepted type, length, format, and so on. Only the value which passes the validation can be processed.

In [19]:
mycursor7 = mydb.cursor(buffered=True)
sql = "SELECT * FROM customers WHERE addressLine1 = %s"
adr = ('54, rue Royale')
mycursor7.execute(sql, adr)
myresult7 = mycursor7.fetchall()
for x in myresult7:
    print(x)

ValueError: Could not process parameters

## 2.10 Order By
- Employs Quick Sort Algoritm or Merge Sort Algorithm
- order by asc
- order by desc

In [20]:
mycursor8 = mydb.cursor(buffered=True)
sql = "SELECT * FROM customers ORDER BY addressLine1 Limit 2"
mycursor8.execute(sql)
myresult8 = mycursor8.fetchall()
for x in myresult8:
    print(x)

(242, 'Alpha Cognac', 'Roulet', 'Annette ', '61.77.6555', '1 rue Alsace-Lorraine', None, 'Toulouse', None, '31000', 'France', 1370, Decimal('61100.00'))
(177, 'Osaka Souveniers Co.', 'Kentary', 'Mory', '+81 06 6342 5555', '1-6-20 Dojima', None, 'Kita-ku', 'Osaka', ' 530-0003', 'Japan', 1621, Decimal('81200.00'))

## 2.11 Delete From By
- Important!: Notice the statement: mydb.commit(). It is required to make the changes, otherwise no changes are made to the table.
- Notice the WHERE clause in the DELETE syntax: The WHERE clause specifies which record(s) that should be deleted. If you omit the WHERE clause, all records will be deleted!

In [21]:
mycursor9 = mydb.cursor(buffered=True)
sql = "DELETE FROM alem WHERE name = 'alem'"
mycursor9.execute(sql)
mydb.commit()
print(mycursor9.rowcount, "record(s) deleted")

1 record(s) deleted

In [22]:
mycursor10 = mydb.cursor(buffered=True)
sql = "INSERT INTO alem (name, age, code) VALUES (%s, %s, %s)"
val = ("emma", 1, 6780)
mycursor10.execute(sql, val)
mydb.commit()
print(mycursor10.rowcount, "record inserted.")
print("1 record inserted, ID:", mycursor10.lastrowid)

1 record inserted.
1 record inserted, ID: 0

In [23]:
mycursor11 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"
mycursor11.execute(sql)
myresult = mycursor11.fetchall()
for x in myresult:
    print(x)

('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('emma', 1, 6780)

## 2.12 Drop Table
- We can delete an existing table by using the "DROP TABLE" statement:

In [24]:
mycursor12 = mydb.cursor(buffered=True)
mycursor12.execute("SHOW TABLES")
for x in mycursor12:
    print(x)

('alem',)
('customers',)
('employees',)
('offices',)
('orderdetails',)
('orders',)
('payments',)
('productlines',)
('products',)

In [25]:
mycursor13 = mydb.cursor(buffered=True)
sql13 = "DROP TABLE IF EXISTS alem"
mycursor13.execute(sql13)

In [26]:
mycursor14 = mydb.cursor(buffered=True)
mycursor14.execute("SHOW TABLES")
tables = [tbl[0] for tbl in mycursor14]
tables

['customers',
 'employees',
 'offices',
 'orderdetails',
 'orders',
 'payments',
 'productlines',
 'products']

In [27]:
mycursor14 = mydb.cursor()
table = """CREATE TABLE alem (
  name varchar(15) NOT NULL,
  age int,
  code int4,
  PRIMARY KEY (code)
) """

mycursor14.execute(table)

sql = "INSERT INTO alem (name, age, code) VALUES (%s, %s, %s)"
val = ("Alem", 40, 1981)
mycursor14.execute(sql, val)
mydb.commit()
print(mycursor14.rowcount, "record inserted.")
print("1 record inserted, ID:", mycursor14.lastrowid)

1 record inserted.
1 record inserted, ID: 0

## 2.13 Update Table
- You can update existing records in a table by using the "UPDATE" statement:

In [28]:
mycursor15 = mydb.cursor(buffered=True)
sql = "UPDATE alem SET age = 40 WHERE name = 'Alem'"
mycursor15.execute(sql)
mydb.commit()
print(mycursor15.rowcount, "record(s) affected")

0 record(s) affected

In [29]:
# prevent injection
mycursor16 = mydb.cursor()
sql = "UPDATE alem SET age = %s WHERE name = %s"
val = (40, "Alem")
mycursor16.execute(sql, val)
mydb.commit()
print(mycursor16.rowcount, "record(s) affected")

0 record(s) affected

## 2.13 Limit
- Limit the Result
    - You can limit the number of records returned from the query, by using the "LIMIT" statement:

In [30]:
mycursor17 = mydb.cursor(buffered=True)
mycursor17.execute("SELECT * FROM customers LIMIT 1")
myresult17 = mycursor17.fetchall()
for x in myresult17:
    print(x)

(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, Decimal('21000.00'))

In [31]:
mycursor18 = mydb.cursor()
mycursor18.execute("SELECT * FROM customers LIMIT 2 OFFSET 2")
myresult18 = mycursor18.fetchall()
for x in myresult18:
    print(x)

(114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 'Australia', 1611, Decimal('117300.00'))
(119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 'France', 1370, Decimal('118200.00'))

In [32]:
from sqlalchemy import create_engine
import pandas as pd

dbcs = 'mysql+pymysql://Alem:brookx150@localhost/alemdb'
dbc = create_engine(dbcs)
qry =  "SELECT * FROM alem"
df = pd.read_sql(qry, con=dbc)
df.head()
#db_connection.close()

   name  age  code
0  Alem   40  1981

## 2.15 Join
- You can combine rows from two or more tables, based on a related column between them, by using a JOIN statement.
- Consider you have a "users" table and a "products" table:

In [33]:
mycursor19 = mydb.cursor()
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  INNER JOIN products ON\
  users.fav = products.id"

mycursor19.execute(sql)
myresult19 = mycursor19.fetchall()
for x in myresult19:
    print(x)

ProgrammingError: 1146 (42S02): Table 'alemdb.users' doesn't exist

# 3. SQL
- Relational (RDBMS)
- Nonrelational (NoSQL) --> MangoDB

## 3.1 What is SQL?
- SQL is the standard language for dealing with Relational Databases.
- SQL is used to insert, search, update, and delete database records.

- How to Use SQL
    - The following SQL statement selects all the records in the "Customers" table:
    
            SELECT * FROM Customers;
            
- Keep in Mind That...
    - SQL keywords are NOT case sensitive: select is the same as SELECT
    - In this tutorial we will write all SQL keywords in upper-case.

## 3.2 Semicolon after SQL Statements?
- Some database systems require a semicolon at the end of each SQL statement.
- Semicolon is the standard way to separate each SQL statement in database systems that allow more than one SQL statement to be executed in the same call to the server.
- In this tutorial, we will use semicolon at the end of each SQL statement.

- Some of The Most Important SQL Commands
    - SELECT - extracts data from a database
    - UPDATE - updates data in a database
    - DELETE - deletes data from a database
    - INSERT INTO - inserts new data into a database
    - CREATE DATABASE - creates a new database
    - ALTER DATABASE - modifies a database
    - CREATE TABLE - creates a new table
    - ALTER TABLE - modifies a table
    - DROP TABLE - deletes a table
    - CREATE INDEX - creates an index (search key)
    - DROP INDEX - deletes an index

## 3.3 MySQL Statements

In [34]:
#!/usr/bin/python
import mysql.connector
from mysql.connector import errorcode
import sys
try:
    mydb = mysql.connector.connect(
      host="localhost",           
      user="Alem",                
      password="brookx150",      
      db="alemdb"                
    )
except:
    print(f"Err:{sys.exc_info()[0]}")
else:
    print(f"Successfully connected to {mydb}")

Successfully connected to <mysql.connector.connection_cext.CMySQLConnection object at 0x7f29b2fe9890>

In [35]:
myc1 = mydb.cursor(buffered=True)
myc1.execute("SHOW TABLES")
tbls = [x[0] for x in myc1]
tbls

['alem',
 'customers',
 'employees',
 'offices',
 'orderdetails',
 'orders',
 'payments',
 'productlines',
 'products']

In [36]:
myc2 = mydb.cursor(buffered=True)
myc2.execute("SELECT * FROM alem")
for x in myc2:
    print(x)

('Alem', 40, 1981)

In [37]:
def insval(name, age, by):
    myc = mydb.cursor(buffered=True)
    sql = "INSERT INTO alem (name, age, code) VALUES (%s, %s, %s)"
    val = (name, age, by)
    myc.execute(sql, val)
    mydb.commit()
    print(myc.rowcount, "Record inserted.")
    print("1 record inserted, ID:", myc.lastrowid)

In [38]:
insval("Tsega", 24, 1997)

1 Record inserted.
1 record inserted, ID: 0

In [39]:
insval("Brook", 3, 2018)

1 Record inserted.
1 record inserted, ID: 0

In [40]:
insval("Emma", 1, 2021)

1 Record inserted.
1 record inserted, ID: 0

In [41]:
myc3 = mydb.cursor(buffered=True)
myc3.execute("SELECT * FROM alem")
for x in myc3:
    print(x)

('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)

### 3.3.1 MySQL SELECT Statement
- The SELECT statement is used to select data from a database.
- The data returned is stored in a result table, called the result-set.
- SELECT Syntax

        SELECT column1, column2, ...
        FROM table_name;

In [42]:
myc4 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"
myc4.execute(sql)
for x in myc4:
    print(x)

('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)

In [43]:
myc4 = mydb.cursor(buffered=True)
sql = "SELECT SUM(age) FROM alem"
myc4.execute(sql)
for x in myc4:
    print(x)

(Decimal('68'),)

In [44]:
myc4 = mydb.cursor(buffered=True)
sql = "SELECT name, code FROM alem"
myc4.execute(sql)
for x in myc4:
    print(x)

('Alem', 1981)
('Tsega', 1997)
('Brook', 2018)
('Emma', 2021)

In [46]:
insval("Emma", 2, 2022)

1 Record inserted.
1 record inserted, ID: 0

In [49]:
myc4 = mydb.cursor(buffered=True)
sql = "SELECT DISTINCT name, code FROM alem"
myc4.execute(sql)
for x in myc4:
    print(x)

('Alem', 1981)
('Tsega', 1997)
('Brook', 2018)
('Emma', 2021)
('Emma', 2022)

In [50]:
myc4 = mydb.cursor(buffered=True)
sql = "SELECT DISTINCT name FROM alem"
myc4.execute(sql)
for x in myc4:
    print(x)

('Alem',)
('Tsega',)
('Brook',)
('Emma',)

### 3.3.2 MySQL WHERE Statement
- The WHERE clause is used to filter records.
- It is used to extract only those records that fulfill a specified condition.
- WHERE Syntax

        SELECT column1, column2, ...
        FROM table_name
        WHERE condition;
- Note: The WHERE clause is not only used in SELECT statements, it is also used in UPDATE, DELETE, etc.!

In [51]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT DISTINCT name FROM alem" +\
       " WHERE age <4"
myc5.execute(sql)
for x in myc5:
    print(x)

('Brook',)
('Emma',)

### Operators in The WHERE Clause
- The following operators can be used in the WHERE clause:

        Operator	Description	Example
               =	Equal	
               >	Greater than	
               <	Less than	
               >=	Greater than or equal	
               <=	Less than or equal	
               <>	Not equal. Note: In some versions of SQL this operator may be written as !=	
           BETWEEN	Between a certain range	
               LIKE	Search for a pattern	
                 IN	To specify multiple possible values for a column

### AND, OR and NOT Operators
-  used to filter records based on more than one condition:

In [54]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT DISTINCT name FROM alem" +\
       " WHERE age <4 AND (name = 'Emma'"+\
       "OR name = 'Brook')"
myc5.execute(sql)
for x in myc5:
    print(x)

('Brook',)
('Emma',)

In [53]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT DISTINCT name FROM alem" +\
       " WHERE age NOT IN (1,2,3)"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem',)
('Tsega',)

### 3.3.3 MySQL ORDER BY Keyword
 - used to sort the result-set in ascending or descending order.
     - ASC (Default)
     - DESC
- By single column or multiple columns

In [61]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem" +\
       " ORDER BY name DESC"
myc5.execute(sql)
for x in myc5:
    print(x)

('Tsega', 24, 1997)
('Emma', 1, 2021)
('Emma', 2, 2022)
('Brook', 3, 2018)
('Alem', 40, 1981)

In [66]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem" +\
       " ORDER BY name, age DESC"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 40, 1981)
('Brook', 3, 2018)
('Emma', 2, 2022)
('Emma', 1, 2021)
('Tsega', 24, 1997)

In [67]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem" +\
       " ORDER BY name ASC, age DESC"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 40, 1981)
('Brook', 3, 2018)
('Emma', 2, 2022)
('Emma', 1, 2021)
('Tsega', 24, 1997)

In [68]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem" +\
       " ORDER BY name DESC, age DESC"
myc5.execute(sql)
for x in myc5:
    print(x)

('Tsega', 24, 1997)
('Emma', 2, 2022)
('Emma', 1, 2021)
('Brook', 3, 2018)
('Alem', 40, 1981)

### 3.3.4 MySQL INSERT INTO Statement
- used to insert new records in a table.
- Insert nothing to autoincrementing ID
- INSERT INTO Syntax
    - It is possible to write the INSERT INTO statement in two ways:
        1. Specify both the column names and the values to be inserted:
        
                INSERT INTO table_name (column1, column2, column3, ...)
                VALUES (value1, value2, value3, ...);
        2. If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query. However, make sure the order of the values is in the same order as the columns in the table. Here, the INSERT INTO syntax would be as follows:

                INSERT INTO table_name
                VALUES (value1, value2, value3, ...);

In [86]:
insval("John", 98, 1922)

1 Record inserted.
1 record inserted, ID: 0

In [87]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem" 
myc5.execute(sql)
for x in myc5:
    print(x)

('', None, 0)
('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

### 3.3.5 NULL Values
- A field with a NULL value is a field with no value.
- If a field in a table is optional, it is possible to insert a new record or update a record without adding a value to this field. Then, the field will be saved with a NULL value.
- Note: A NULL value is different from a zero value or a field that contains spaces. A field with a NULL value is one that has been left blank during record creation!
- It is not possible to test for NULL values with comparison operators, such as =, <, or <>.
- We will have to use the **IS NULL and IS NOT NULL** operators instead.
- IS NULL Syntax

            SELECT column_names
            FROM table_name
            WHERE column_name IS NULL;

In [88]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem WHERE age IS NOT NULL" 
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

In [89]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem WHERE age IS NULL" 
myc5.execute(sql)
for x in myc5:
    print(x)

('', None, 0)

### 3.3.6 MySQL UPDATE Statement
- used to modify the existing records in a table.
- UPDATE Syntax
        
        UPDATE table_name
        SET column1 = value1, column2 = value2, ...
        WHERE condition;
        
- Note: Be careful when updating records in a table! Notice the WHERE clause in the UPDATE statement. The WHERE clause specifies which record(s) that should be updated. If you omit the WHERE clause, all records in the table will be updated!

- Before Update

In [90]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem" 
myc5.execute(sql)
for x in myc5:
    print(x)

('', None, 0)
('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

- Update

In [92]:
myc5 = mydb.cursor(buffered=True)
sql = "UPDATE alem"+\
      " SET name= 'Null', age = 0,"+\
      " code = 2000"+\
      " WHERE age IS NULL" 
myc5.execute(sql)

- After Update

In [93]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem" 
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Null', 0, 2000)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

### 3.3.7 MySQL DELETE Statement
- used to delete existing records in a table.
- DELETE Syntax

        DELETE FROM table_name 
        WHERE condition;
        
- Note: Be careful when deleting records in a table! Notice the WHERE clause in the DELETE statement. The WHERE clause specifies which record(s) should be deleted. If you omit the WHERE clause, all records in the table will be deleted!

In [94]:
myc5 = mydb.cursor(buffered=True)
sql = "DELETE FROM alem"+\
      " WHERE name = 'Null'"
myc5.execute(sql)

In [95]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem" 
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

- It is possible to delete all rows in a table without deleting the table. This means that the table structure, attributes, and indexes will be intact:

        DELETE FROM table_name;

### 3.3.8 MySQL LIMIT Clause
- used to specify the number of records to return.
- The LIMIT clause is useful on large tables with thousands of records. Returning a large number of records can impact performance.
- LIMIT Syntax

        SELECT column_name(s)
        FROM table_name
        WHERE condition
        LIMIT number;
- The two arguments 10,10 are (Offset, Limit) so this will retrieve rows 11-20. 9,11 Would be required to grab the 10th - 20th rank.

In [96]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem LIMIT 2" 
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)

In [97]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " ORDER BY name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 40, 1981)
('Brad', 88, 1932)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)
('John', 98, 1922)
('Tsega', 24, 1997)

In [105]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem LIMIT 0,3" 
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)

### 3.3.9 MySQL MIN() and MAX()
- The MIN() function returns the smallest value of the selected column.

        SELECT MIN(column_name)
        FROM table_name
        WHERE condition;
- The MAX() function returns the largest value of the selected column.

        SELECT MAX(column_name)
        FROM table_name
        WHERE condition;

In [106]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT MIN(age) FROM alem" 
myc5.execute(sql)
for x in myc5:
    print(x)

(1,)

In [107]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT Max(age) FROM alem" 
myc5.execute(sql)
for x in myc5:
    print(x)

(98,)

- Sort by age

In [113]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " ORDER BY age"
myc5.execute(sql)
for x in myc5:
    print(x)

('Emma', 1, 2021)
('Emma', 2, 2022)
('Brook', 3, 2018)
('Tsega', 24, 1997)
('Alem', 40, 1981)
('Brad', 88, 1932)
('John', 98, 1922)

- Second Max Age

In [111]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT Max(age) FROM alem"+\
      " WHERE age < (SELECT Max(age) FROM alem)"
myc5.execute(sql)
for x in myc5:
    print(x)

(88,)

- Second minimum

In [112]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT Min(age) FROM alem"+\
      " WHERE age > (SELECT Min(age) FROM alem)"
myc5.execute(sql)
for x in myc5:
    print(x)

(2,)

### 3.3.10 MySQL COUNT(), AVG() and SUM() Functions
- The COUNT() function returns the number of rows that matches a specified criterion.
- COUNT() Syntax

        SELECT COUNT(column_name)
        FROM table_name
        WHERE condition;
- The AVG() function returns the average value of a numeric column. 

        AVG() Syntax
        SELECT AVG(column_name)
        FROM table_name
        WHERE condition;
- The SUM() function returns the total sum of a numeric column. 

        SUM() Syntax
        SELECT SUM(column_name)
        FROM table_name
        WHERE condition;

In [114]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT count(*) FROM alem"
myc5.execute(sql)
for x in myc5:
    print(x)

(7,)

In [115]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT avg(age) FROM alem"
myc5.execute(sql)
for x in myc5:
    print(x)

(Decimal('36.5714'),)

In [116]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT sum(age) FROM alem"
myc5.execute(sql)
for x in myc5:
    print(x)

(Decimal('256'),)

### 3.3.11 MySQL LIKE Operator
- used in a WHERE clause to search for a specified pattern in a column.
- There are two wildcards often used in conjunction with the LIKE operator:
    - The percent sign (%) represents zero, one, or multiple characters
    - The underscore sign (_) represents one, single character
- The percent sign and the underscore can also be used in combinations!
- LIKE Syntax

        SELECT column1, column2, ...
        FROM table_name
        WHERE columnN LIKE pattern;
        
        'a%'
        '%a'
        '_a%'
        'a_%'
        'a%o'
        '%a%'
        
- Tip: You can also combine any number of conditions using AND or OR operators.

In [118]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE name LIKE 'a%'"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 40, 1981)

In [120]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE name LIKE '%d'"
myc5.execute(sql)
for x in myc5:
    print(x)

('Brad', 88, 1932)

In [121]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE name LIKE 'e%a'"
myc5.execute(sql)
for x in myc5:
    print(x)

('Emma', 1, 2021)
('Emma', 2, 2022)

In [122]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE name LIKE '%se%'"
myc5.execute(sql)
for x in myc5:
    print(x)

('Tsega', 24, 1997)

### 3.3.12 MySQL Wildcard Characters
- A wildcard character is used to substitute one or more characters in a string.
- Wildcard characters are used with the LIKE operator. 
- The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.
- Wildcard Characters in MySQL

|Symbol	|Description	|Example|
|---|---|---|
| %	|Represents zero or more characters	|bl% finds bl, black, blue, and blob|
| _	|Represents a single character	|h_t finds hot, hat, and hit|

- The wildcards can also be used in combinations! Here are some examples showing different LIKE operators with '%' and '_' wildcards:

|LIKE Operator	|Description|
|---|---|
|WHERE CustomerName LIKE 'a%'	|Finds any values that starts with "a"|
|WHERE CustomerName LIKE '%a'	|Finds any values that ends with "a"|
|WHERE CustomerName LIKE '%or%'	|Finds any values that have "or" in any position|
|WHERE CustomerName LIKE '_r%'	|Finds any values that have "r" in the second position|
|WHERE CustomerName LIKE 'a_%_%'	|Finds any values that starts with "a" and are at least 3 characters in length|
|WHERE ContactName LIKE 'a%o'	|Finds any val|

In [123]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE name LIKE '%T_%_%'"
myc5.execute(sql)
for x in myc5:
    print(x)

('Tsega', 24, 1997)

### 3.3.13 MySQL IN Operator
- The IN operator allows you to specify multiple values in a WHERE clause.
- The IN operator is a shorthand for multiple OR conditions.
- IN Syntax

        SELECT column_name(s)
        FROM table_name
        WHERE column_name IN (value1, value2, ...);
        
        SELECT column_name(s)
        FROM table_name
        WHERE column_name IN (SELECT STATEMENT);

In [124]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE name IN ('Alem', 'Tsega')"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 40, 1981)
('Tsega', 24, 1997)

In [126]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE name IN("+\
      "SELECT name FROM alem"+\
      " WHERE name IN('Emma', 'Brook'))"
myc5.execute(sql)
for x in myc5:
    print(x)

('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

### 3.3.14 MySQL BETWEEN Operator
- The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates.
- The BETWEEN operator is inclusive: begin and end values are included.
- BETWEEN Syntax

        SELECT column_name(s)
        FROM table_name
        WHERE column_name BETWEEN value1 AND value2;

In [127]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE age BETWEEN 1 AND 25"
myc5.execute(sql)
for x in myc5:
    print(x)

('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

In [129]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE age NOT BETWEEN 1 AND 25"+\
      " AND name NOT IN ('John', 'Alem')"
myc5.execute(sql)
for x in myc5:
    print(x)

('Brad', 88, 1932)

In [131]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

In [134]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE name BETWEEN 'Alem'"+\
      " AND 'Emma'"
myc5.execute(sql)
for x in myc5:
    print(x)

('Brad', 88, 1932)
('Alem', 40, 1981)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

In [135]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE name NOT BETWEEN 'Alem'"+\
      " AND 'Emma'"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Tsega', 24, 1997)

### 3.3.15 MySQL Aliases
- Aliases are used to give a table, or a column in a table, a temporary name.
- Aliases are often used to make column names more readable.
- An alias only exists for the duration of that query.
- An alias is created with the AS keyword.
- Alias Column Syntax

        SELECT column_name AS alias_name
        FROM table_name;
- Alias Table Syntax

        SELECT column_name(s)
        FROM table_name AS alias_name;

In [138]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name, concat_ws('-',age,code)"+\
      " AS agecode FROM alem"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', '98-1922')
('Brad', '88-1932')
('Alem', '40-1981')
('Tsega', '24-1997')
('Brook', '3-2018')
('Emma', '1-2021')
('Emma', '2-2022')

In [139]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name, concat(age,code)"+\
      " AS agecode FROM alem"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', '981922')
('Brad', '881932')
('Alem', '401981')
('Tsega', '241997')
('Brook', '32018')
('Emma', '12021')
('Emma', '22022')

In [140]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT a.name, a.age,a.code"+\
      " FROM alem AS a"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

In [145]:
# No need to add table alias before col names
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name, age, code"+\
      " FROM alem AS a "
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

In [144]:
# When dealing >=2 tables, names must 
# be prefixed with table alias name
myc5 = mydb.cursor(buffered=True)
sql = "SELECT a.name, a.age, a.code"+\
      " FROM alem AS a, alem as o"+\
      " WHERE a.name = o.name"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)
('Emma', 1, 2021)
('Emma', 2, 2022)

### 3.3.16 MySQL Joins
- A JOIN clause is used to combine rows from two or more tables, based on a related column between them.

        SELECT t1.c1, t2.c2
        FROM t1
        INNER JOIN t2 
        ON 1.c1=t2.c2;
- Supported Types of Joins in MySQL
    - **INNER JOIN**: Returns records that have matching values in both tables
    - **LEFT JOIN**: Returns all records from the left table, and the matched records from the right table
    - **RIGHT JOIN**: Returns all records from the right table, and the matched records from the left table
    - **CROSS JOIN**: Returns all records from both tables        
- **Note: CROSS JOIN can potentially return very large result-sets!**

- Create tbl1 and tbl2 for join examples

In [157]:
def create_tbl(tbl, sql, val):
    mc = mydb.cursor(buffered=True)
    if tbl != None:
        mc.execute(tbl)
    mc.execute(sql, val)
    mydb.commit()
    print(mc.rowcount, "record inserted.")
    print("ID of insered record:", mc.lastrowid)

In [162]:
tbl1 = """CREATE TABLE tbl1 (
          name varchar(15) NOT NULL,
         degree TEXT,
         bplace TEXT         
         ) """

In [164]:
tbl1 = None
sql1 =  "INSERT INTO tbl1 (name, degree, bplace) VALUES (%s, %s, %s)"
val1 =  ("Alem", 'TD', 'Adigrat')
create_tbl(tbl1, sql1, val1)

1 record inserted.
ID of insered record: 0

In [165]:
tbl1 = None
sql1 =  "INSERT INTO tbl1 (name, degree, bplace) VALUES (%s, %s, %s)"
val1 =  ("Emma", 'None', 'New York')
create_tbl(tbl1, sql1, val1)

1 record inserted.
ID of insered record: 0

In [166]:
tbl1 = None
sql1 =  "INSERT INTO tbl1 (name, degree, bplace) VALUES (%s, %s, %s)"
val1 =  ("Brook", 'None', 'Mekelle')
create_tbl(tbl1, sql1, val1)

1 record inserted.
ID of insered record: 0

In [167]:
tbl1 = None
sql1 =  "INSERT INTO tbl1 (name, degree, bplace) VALUES (%s, %s, %s)"
val1 =  ("Tsega", 'HD', 'Hawzen')
create_tbl(tbl1, sql1, val1)

1 record inserted.
ID of insered record: 0

In [168]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM tbl1"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 'TD', 'Adigrat')
('Emma', 'None', 'New York')
('Brook', 'None', 'Mekelle')
('Tsega', 'HD', 'Hawzen')

In [169]:
myc5 = mydb.cursor(buffered=True)
sql = "CREATE TABLE tbl2 AS SELECT * FROM alem"
myc5.execute(sql)

In [170]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM tbl2"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

- INNER JOIN tbl1 and tbl2
<img src = "./figs/innerjoin.gif">

In [171]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT t1.name, t1.degree, t1.bplace, "+\
      "t2.name, t2.age, t2.code"+\
      " FROM tbl1 AS t1"+\
      " INNER JOIN tbl2 as t2"+\
      " ON t1.name = t2.name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 'TD', 'Adigrat', 'Alem', 40, 1981)
('Tsega', 'HD', 'Hawzen', 'Tsega', 24, 1997)
('Brook', 'None', 'Mekelle', 'Brook', 3, 2018)
('Emma', 'None', 'New York', 'Emma', 1, 2021)
('Emma', 'None', 'New York', 'Emma', 2, 2022)

- INNER JOIN alem, tbl1 and tbl2

In [177]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT a.name, a.age, a.code, "+\
      "t1.name, t1.degree, t1.bplace, "+\
      "t2.name, t2.age, t2.code"+\
      " FROM ((alem AS a"+\
      " INNER JOIN tbl1 AS t1"+\
      " ON a.name = t1.name)"+\
      " INNER JOIN tbl2 as t2"+\
      " ON a.name = t2.name)"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 40, 1981, 'Alem', 'TD', 'Adigrat', 'Alem', 40, 1981)
('Tsega', 24, 1997, 'Tsega', 'HD', 'Hawzen', 'Tsega', 24, 1997)
('Brook', 3, 2018, 'Brook', 'None', 'Mekelle', 'Brook', 3, 2018)
('Emma', 1, 2021, 'Emma', 'None', 'New York', 'Emma', 1, 2021)
('Emma', 2, 2022, 'Emma', 'None', 'New York', 'Emma', 1, 2021)
('Emma', 1, 2021, 'Emma', 'None', 'New York', 'Emma', 2, 2022)
('Emma', 2, 2022, 'Emma', 'None', 'New York', 'Emma', 2, 2022)

In [178]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT a.name, a.age, a.code, "+\
      "t1.name, t1.degree, t1.bplace, "+\
      "t2.name, t2.age, t2.code"+\
      " FROM ((alem AS a"+\
      " INNER JOIN tbl1 AS t1"+\
      " ON a.name = t1.name)"+\
      " INNER JOIN tbl2 as t2"+\
      " ON t1.name = t2.name)"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 40, 1981, 'Alem', 'TD', 'Adigrat', 'Alem', 40, 1981)
('Tsega', 24, 1997, 'Tsega', 'HD', 'Hawzen', 'Tsega', 24, 1997)
('Brook', 3, 2018, 'Brook', 'None', 'Mekelle', 'Brook', 3, 2018)
('Emma', 1, 2021, 'Emma', 'None', 'New York', 'Emma', 1, 2021)
('Emma', 2, 2022, 'Emma', 'None', 'New York', 'Emma', 1, 2021)
('Emma', 1, 2021, 'Emma', 'None', 'New York', 'Emma', 2, 2022)
('Emma', 2, 2022, 'Emma', 'None', 'New York', 'Emma', 2, 2022)

- LEFT JOIN
<img src = "./figs/leftjoin.gif">

In [172]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT t1.name, t1.degree, t1.bplace, "+\
      "t2.name, t2.age, t2.code"+\
      " FROM tbl1 AS t1"+\
      " LEFT JOIN tbl2 as t2"+\
      " ON t1.name = t2.name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 'TD', 'Adigrat', 'Alem', 40, 1981)
('Tsega', 'HD', 'Hawzen', 'Tsega', 24, 1997)
('Brook', 'None', 'Mekelle', 'Brook', 3, 2018)
('Emma', 'None', 'New York', 'Emma', 1, 2021)
('Emma', 'None', 'New York', 'Emma', 2, 2022)

- RIGHT JOIN
<img src = "./figs/rightjoin.gif">

In [173]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT t1.name, t1.degree, t1.bplace, "+\
      "t2.name, t2.age, t2.code"+\
      " FROM tbl1 AS t1"+\
      " RIGHT JOIN tbl2 as t2"+\
      " ON t1.name = t2.name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 'TD', 'Adigrat', 'Alem', 40, 1981)
('Emma', 'None', 'New York', 'Emma', 1, 2021)
('Emma', 'None', 'New York', 'Emma', 2, 2022)
('Brook', 'None', 'Mekelle', 'Brook', 3, 2018)
('Tsega', 'HD', 'Hawzen', 'Tsega', 24, 1997)
(None, None, None, 'John', 98, 1922)
(None, None, None, 'Brad', 88, 1932)

- CROSS JOIN
<img src = "./figs/crossjoin.png">

In [174]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT t1.name, t1.degree, t1.bplace, "+\
      "t2.name, t2.age, t2.code"+\
      " FROM tbl1 AS t1"+\
      " CROSS JOIN tbl2 as t2"+\
      " ON t1.name = t2.name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 'TD', 'Adigrat', 'Alem', 40, 1981)
('Tsega', 'HD', 'Hawzen', 'Tsega', 24, 1997)
('Brook', 'None', 'Mekelle', 'Brook', 3, 2018)
('Emma', 'None', 'New York', 'Emma', 1, 2021)
('Emma', 'None', 'New York', 'Emma', 2, 2022)

### 3.3.17 MySQL Self Join
- A self join is a regular join, but the table is joined with itself.
- Self Join Syntax

        SELECT column_name(s)
        FROM table1 T1, table1 T2
        WHERE condition;
- T1 and T2 are different table aliases for the same table.

In [183]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT t1.name, t2.name"+\
      " FROM alem t1, alem t2"+\
      " WHERE t1.name <> t2.name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Brad', 'John')
('Alem', 'John')
('Tsega', 'John')
('Brook', 'John')
('Emma', 'John')
('Emma', 'John')
('John', 'Brad')
('Alem', 'Brad')
('Tsega', 'Brad')
('Brook', 'Brad')
('Emma', 'Brad')
('Emma', 'Brad')
('John', 'Alem')
('Brad', 'Alem')
('Tsega', 'Alem')
('Brook', 'Alem')
('Emma', 'Alem')
('Emma', 'Alem')
('John', 'Tsega')
('Brad', 'Tsega')
('Alem', 'Tsega')
('Brook', 'Tsega')
('Emma', 'Tsega')
('Emma', 'Tsega')
('John', 'Brook')
('Brad', 'Brook')
('Alem', 'Brook')
('Tsega', 'Brook')
('Emma', 'Brook')
('Emma', 'Brook')
('John', 'Emma')
('Brad', 'Emma')
('Alem', 'Emma')
('Tsega', 'Emma')
('Brook', 'Emma')
('John', 'Emma')
('Brad', 'Emma')
('Alem', 'Emma')
('Tsega', 'Emma')
('Brook', 'Emma')

In [184]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT COUNT(*) FROM alem"
myc5.execute(sql)
for x in myc5:
    print(x)

(7,)

### 3.3.18 MySQL UNION Operator
- The UNION operator is used to combine the result-set of two or more SELECT statements.
    - Every SELECT statement within UNION must have the same number of columns
    - The columns must also have similar data types
    - The columns in every SELECT statement must also be in the same order
    
            SELECT column_name(s) FROM table1
            UNION
            SELECT column_name(s) FROM table2;

In [185]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name FROM alem"+\
        " UNION"+\
      " SELECT degree FROM tbl1"
myc5.execute(sql)
for x in myc5:
    print(x)

('John',)
('Brad',)
('Alem',)
('Tsega',)
('Brook',)
('Emma',)
('TD',)
('None',)
('HD',)

- The UNION operator selects only distinct values by default. To allow duplicate values, use UNION ALL:

In [186]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name FROM alem"+\
        " UNION ALL"+\
      " SELECT degree FROM tbl1"
myc5.execute(sql)
for x in myc5:
    print(x)

('John',)
('Brad',)
('Alem',)
('Tsega',)
('Brook',)
('Emma',)
('Emma',)
('TD',)
('None',)
('None',)
('HD',)

- UNION With WHERE

In [188]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name FROM alem"+\
      " WHERE age < 50"+\
        " UNION"+\
      " SELECT degree FROM tbl1"+\
      " WHERE degree NOT IN ('TD')"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem',)
('Tsega',)
('Brook',)
('Emma',)
('None',)
('HD',)

- UNION ALL With WHERE

In [189]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name FROM alem"+\
      " WHERE age < 50"+\
        " UNION ALL"+\
      " SELECT degree FROM tbl1"+\
      " WHERE degree NOT IN ('TD')"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem',)
('Tsega',)
('Brook',)
('Emma',)
('Emma',)
('None',)
('None',)
('HD',)

### 3.3.19 MySQL GROUP BY Statement
- The GROUP BY statement groups rows that have the same values into summary rows, like "find the number of customers in each country".
- The GROUP BY statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.
- GROUP BY Syntax

        SELECT column_name(s)
        FROM table_name
        WHERE condition
        GROUP BY column_name(s)
        ORDER BY column_name(s);

In [192]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem ORDER BY name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 40, 1981)
('Brad', 88, 1932)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)
('John', 98, 1922)
('Tsega', 24, 1997)

In [191]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name, sum(age), sum(code) FROM alem"+\
      " GROUP BY name"+\
      " ORDER BY name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', Decimal('40'), Decimal('1981'))
('Brad', Decimal('88'), Decimal('1932'))
('Brook', Decimal('3'), Decimal('2018'))
('Emma', Decimal('3'), Decimal('4043'))
('John', Decimal('98'), Decimal('1922'))
('Tsega', Decimal('24'), Decimal('1997'))

In [194]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT t1.name, t1.degree, t1.bplace, "+\
      "t2.name, t2.age, t2.code"+\
      " FROM tbl1 AS t1"+\
      " INNER JOIN tbl2 as t2"+\
      " ON t1.name = t2.name"+\
      " ORDER BY t1.name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 'TD', 'Adigrat', 'Alem', 40, 1981)
('Brook', 'None', 'Mekelle', 'Brook', 3, 2018)
('Emma', 'None', 'New York', 'Emma', 1, 2021)
('Emma', 'None', 'New York', 'Emma', 2, 2022)
('Tsega', 'HD', 'Hawzen', 'Tsega', 24, 1997)

### 3.3.20 MySQL HAVING Clause
- The HAVING clause was added to SQL because the WHERE keyword cannot be used with aggregate functions.
- HAVING Syntax

        SELECT column_name(s)
        FROM table_name
        WHERE condition
        GROUP BY column_name(s)
        HAVING condition
        ORDER BY column_name(s);

In [197]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name, sum(age), sum(code) FROM alem"+\
      " WHERE age < 50"+\
      " GROUP BY name"+\
      " HAVING sum(code)> 3000"+\
      " ORDER BY name"
myc5.execute(sql)
for x in myc5:
    print(x)

('Emma', Decimal('3'), Decimal('4043'))

### 3.3.21 MySQL EXISTS Operator
- The EXISTS operator is used to test for the existence of any record in a subquery.
- The EXISTS operator returns TRUE if the subquery returns one or more records.
- EXISTS Syntax

        SELECT column_name(s)
        FROM table_name
        WHERE EXISTS
            (SELECT column_name 
             FROM table_name 
             WHERE condition);

In [206]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE EXISTS"+\
      " (SELECT age"+\
      " FROM alem"+\
      " WHERE age <50)"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

In [211]:
# Returns Nothing
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE EXISTS"+\
      " (SELECT age"+\
      " FROM alem"+\
      " WHERE age > 150)"

myc5.execute(sql)
for x in myc5:
    print(x)
print(myc5)

CMySQLCursorBuffered: SELECT * FROM alem WHERE EXISTS (SELECT ..

### 3.3.22 MySQL ANY and ALL Operators
- he ANY and ALL operators allow you to perform a comparison between a single column value and a range of other values.
- The ANY operator:
    - returns a boolean value as a result
    - returns TRUE if ANY of the subquery values meet the condition
- ANY means that the condition will be true if the operation is true for any of the values in the range.
- ANY Syntax

        SELECT column_name(s)
        FROM table_name
        WHERE column_name operator ANY
          (SELECT column_name
          FROM table_name
          WHERE condition);
   - Note: The operator must be a standard comparison operator (=, <>, !=, >, >=, <, or <=).
   
- The ALL Operator
    - returns a boolean value as a result
    - returns TRUE if ALL of the subquery values meet the condition
    - is used with SELECT, WHERE and HAVING statements
- ALL means that the condition will be true only if the operation is true for all values in the range.
- ALL Syntax With SELECT

        SELECT ALL column_name(s)
        FROM table_name
        WHERE condition;
- ALL Syntax With WHERE or HAVING

        SELECT column_name(s)
        FROM table_name
        WHERE column_name operator ALL
          (SELECT column_name
          FROM table_name
          WHERE condition);

In [219]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE age = ANY"\
      " (SELECT age"+\
      " FROM alem"+\
      " WHERE name = 'Emma')"
myc5.execute(sql)
for x in myc5:
    print(x)

('Emma', 1, 2021)
('Emma', 2, 2022)

In [220]:
# Returns nothing
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM alem"+\
      " WHERE age = ALL"\
      " (SELECT age"+\
      " FROM alem"+\
      " WHERE age >1)"
myc5.execute(sql)
for x in myc5:
    print(x)

### 3.3.23 MySQL INSERT INTO SELECT Statement
- The INSERT INTO SELECT statement copies data from one table and inserts it into another table.
- The INSERT INTO SELECT statement requires that the data types in source and target tables matches.
- Note: The existing records in the target table are unaffected.

- INSERT INTO SELECT Syntax
    - Copy all columns from one table to another table:

            INSERT INTO table2
            SELECT * FROM table1
            WHERE condition;
    - Copy only some columns from one table into another table:

            INSERT INTO table2 (column1, column2, column3, ...)
            SELECT column1, column2, column3, ...
            FROM table1
            WHERE condition;

In [222]:
# Copy entire table
myc5 = mydb.cursor(buffered=True)
sql = "INSERT INTO tbl2"+\
      " SELECT * FROM alem"+\
      " WHERE age > 1"
myc5.execute(sql)

In [223]:
# Copy entire table
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM tbl2"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)
('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 2, 2022)

In [227]:
# Copy entire table
myc5 = mydb.cursor(buffered=True)
sql = "INSERT INTO tbl2 (name, age, code)"+\
      " SELECT name, age, code FROM alem"+\
      " WHERE age< 50"
myc5.execute(sql)

In [229]:
# Partial copy
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * FROM tbl2"
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)
('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 2, 2022)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

### 3.3.24 MySQL CASE Statement
- The CASE statement goes through conditions and returns a value when the first condition is met (like an if-then-else statement). So, once a condition is true, it will stop reading and return the result. If no conditions are true, it returns the value in the ELSE clause.
- If there is no ELSE part and no conditions are true, it returns NULL.
- CASE Syntax

        CASE
            WHEN condition1 THEN result1
            WHEN condition2 THEN result2
            WHEN conditionN THEN resultN
            ELSE result
        END;

In [236]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name, age, code,"+\
      " CASE"+\
            " WHEN age <18 THEN 'Teen'"+\
            " WHEN age BETWEEN 3 AND 5 THEN 'Child'"+\
            " WHEN age BETWEEN 5 AND 18 THEN 'TEEN'"+\
            " ELSE 'Adult'"+\
            " END AS 'class'"+\
      " FROM alem"
    
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922, 'Adult')
('Brad', 88, 1932, 'Adult')
('Alem', 40, 1981, 'Adult')
('Tsega', 24, 1997, 'Adult')
('Brook', 3, 2018, 'Teen')
('Emma', 1, 2021, 'Teen')
('Emma', 2, 2022, 'Teen')

In [239]:
# Ordering using case
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name, age, code"+\
      " FROM alem"+\
      " ORDER BY"+\
      " (CASE"+\
            " WHEN name IS NULL THEN age"+\
      " ELSE name"+\
      " END)"
    
myc5.execute(sql)
for x in myc5:
    print(x)

('Alem', 40, 1981)
('Brad', 88, 1932)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)
('John', 98, 1922)
('Tsega', 24, 1997)

### 3.3.25 MySQL NULL & COALESCE Functions
- The MySQL IFNULL() function lets you return an alternative value if an expression is NULL.
- The example below returns 0 if the value is NULL:

In [244]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name, age + IFNULL(code, 0) AS sum1"+\
      " FROM alem"   
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 2020)
('Brad', 2020)
('Alem', 2021)
('Tsega', 2021)
('Brook', 2021)
('Emma', 2022)
('Emma', 2024)

In [248]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT name, age + coalesce(code, 0) AS sum1 /*summed*/"+\
      " FROM alem"   
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 2020)
('Brad', 2020)
('Alem', 2021)
('Tsega', 2021)
('Brook', 2021)
('Emma', 2022)
('Emma', 2024)

### 3.3.26 MySQL Comments
- Comments are used to explain sections of SQL statements, or to prevent execution of SQL statements.

        -- Select all:
        SELECT * FROM alem;
        
        /*Select all the columns
        of all the records
        in the alem table:*/
        SELECT * FROM alem;

In [249]:
myc5 = mydb.cursor(buffered=True)
sql = "SELECT * /*Select all columns from table alem*/"+\
      " FROM alem"   
myc5.execute(sql)
for x in myc5:
    print(x)

('John', 98, 1922)
('Brad', 88, 1932)
('Alem', 40, 1981)
('Tsega', 24, 1997)
('Brook', 3, 2018)
('Emma', 1, 2021)
('Emma', 2, 2022)

### 3.3.27 MySQL Operators
- Arithmetic Operators
      
      Operator	Description	Example
            +	Add	
            -	Subtract	
            *	Multiply	
            /	Divide	
            %	Modulo
            
- Bitwise Operators

            Operator	Description
                    &	Bitwise AND
                    |	Bitwise OR
                    ^	Bitwise exclusive OR
                    
- Comparison Operators

            Operator	Description	Example
                    =	Equal to	
                    >	Greater than	
                    <	Less than	
                    >=	Greater than or equal to	
                    <=	Less than or equal to	
                    <>	Not equal to
                    
- Compound Operators

            Operator	Description
                    +=	Add equals
                    -=	Subtract equals
                    *=	Multiply equals
                    /=	Divide equals
                    %=	Modulo equals
                    &=	Bitwise AND equals
                    ^-=	Bitwise exclusive equals
                    |*=	Bitwise OR equals
                    
- Logical Operators

        Operator	Description	Example
                ALL	TRUE if all of the subquery values meet the condition	
                AND	TRUE if all the conditions separated by AND is TRUE	
                ANY	TRUE if any of the subquery values meet the condition	
                BETWEEN	TRUE if the operand is within the range of comparisons	
                EXISTS	TRUE if the subquery returns one or more records	
                    IN	TRUE if the operand is equal to one of a list of expressions	
                LIKE	TRUE if the operand matches a pattern	
                    NOT	Displays a record if the condition(s) is NOT TRUE	
                    OR	TRUE if any of the conditions separated by OR is TRUE	
                SOME	TRUE if any of the subquery values meet the condition

# 4. MySQL Database
- Connection to existing databases

- Method-1

In [267]:
from mysql.connector import connect
from mysql.connector import errorcode

 
try: 
    cnx = connect(user='Alem', 
              password='brookx150',
              host='localhost',
              database='testdb')
except mysql.connector.Error as err:
    if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Something is wrong with your username or password")
    elif err.errno == errorcode.ER_BAD_DB_ERROR:
        print("Database does not exist")
    else:
        print(err)
else:
    print(f"Successfully connected to {cnx}")    
    cnx.close()

1044 (42000): Access denied for user 'Alem'@'localhost' to database 'testdb'

- Method-2

In [272]:
from mysql.connector import connection
from mysql.connector import errorcode

try: 
    cnx = connection.MySQLConnection(user='Alem', 
              password='brookx150',
              host='localhost',
              database='alemdb')
except mysql.connector.Error as err:
    if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Something is wrong with your username or password")
    elif err.errno == errorcode.ER_BAD_DB_ERROR:
        print("Database does not exist")
    else:
        print(err)
else:
    print(f"Successfully connected to {cnx}")    
    cnx.close()

Successfully connected to <mysql.connector.connection.MySQLConnection object at 0x7f29b2f03f50>

- Method-3

In [273]:
import mysql.connector

config = {
  'user': 'Alem',
  'password': 'brookx150',
  'host': 'localhost',
  'database': 'alemdb',
  'raise_on_warnings': True
}
try: 
    cnx = mysql.connector.connect(**config)
except mysql.connector.Error as err:
    if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Something is wrong with your username or password")
    elif err.errno == errorcode.ER_BAD_DB_ERROR:
        print("Database does not exist")
    else:
        print(err)
else:
    print(f"Successfully connected to {cnx}")    
    cnx.close()

Successfully connected to <mysql.connector.connection_cext.CMySQLConnection object at 0x7f29b2f2b750>

- Using the Connector/Python Python or C Extension
    - Setting use_pure=False causes the connection to use the C Extension if your Connector/Python installation includes it, while use_pure=True to False means the Python implementation is used if available.

In [274]:
import mysql.connector

cnx = mysql.connector.connect(user='Alem', password='brookx150',
                              host='127.0.0.1',
                              database='alemdb',
                              use_pure=False)
cnx.close()

### 4.1 CREATE DATABASE Statement
- The CREATE DATABASE statement is used to create a new SQL database.

        CREATE DATABASE databasename;        
- Tip: Make sure you have admin privilege before creating any database. Once a database is created, you can check it in the list of databases with the following SQL command: SHOW DATABASES;

        mysql> CREATE DATABASE testdb;
        Query OK, 1 row affected (0.00 sec)
        mysql> show databases;
        +--------------------+
        | Database           |
        +--------------------+
        | information_schema |
        | alemdb             |
        | classicmodels      |
        | mysql              |
        | performance_schema |
        | sys                |
        | testdb             |
        +--------------------+

- Steps
    1. Connect using mysql.connecttor.connect
    
            conn = connect(host = '', user = '', password = '')
    2. Create a Cursor using conn
    
            cur =  conn.cursor(buffered=True)
    3. Execute the request/sql statements
    
            cur.execute(sql-statment)
    4. Acess Data/tables is sql statement is query

In [259]:
#!/usr/bin/python
from mysql.connector import connect
from mysql.connector import errorcode
import sys
try:
    mydb1 = connect(
      host="localhost",           
      user="Alem",               
      password="brookx150"      
    )
    cdb = mydb1.cursor(buffered=True)
    cdb.execute("CREATE DATABASE testdb2")
except:
    print(f"Err:{sys.exc_info()[0]}")
else:
    print(f"Successfully connected to {mydb1}")

Err:<class 'mysql.connector.errors.ProgrammingError'>

In [260]:
cdb = mydb1.cursor(buffered=True)
cdb.execute("show databases")
for x in cdb:
    print(x)

('information_schema',)
('alemdb',)

### Creating Tables Using Connector/Python
- All DDL (Data Definition Language) statements are executed using a handle structure known as a **cursor**. The following examples show how to create the tables of the Employee Sample Database. You need them for the other examples.
- In a MySQL server, tables are very long-lived objects, and are often accessed by multiple applications written in different languages. You might typically work with tables that are already set up, rather than creating them within your own application. Avoid setting up and dropping tables over and over again, as that is an expensive operation. The exception is temporary tables, which can be created and dropped quickly within an application.

In [300]:
from mysql.connector import connect, Error
from mysql.connector import errorcode

DB_NAME = 'employees'

TABLES = {}
TABLES['employees'] = (
    "CREATE TABLE `employees1` ("
    "  `emp_no` int(11) NOT NULL AUTO_INCREMENT,"
    "  `birth_date` date NOT NULL,"
    "  `first_name` varchar(14) NOT NULL,"
    "  `last_name` varchar(16) NOT NULL,"
    "  `gender` enum('M','F') NOT NULL,"
    "  `hire_date` date NOT NULL,"
    "  PRIMARY KEY (`emp_no`)"
    ") ENGINE=InnoDB")

TABLES['departments'] = (
    "CREATE TABLE `departments1` ("
    "  `dept_no` char(4) NOT NULL,"
    "  `dept_name` varchar(40) NOT NULL,"
    "  PRIMARY KEY (`dept_no`), UNIQUE KEY `dept_name` (`dept_name`)"
    ") ENGINE=InnoDB")

TABLES['salaries'] = (
    "CREATE TABLE `salaries1` ("
    "  `emp_no` int(11) NOT NULL,"
    "  `salary` int(11) NOT NULL,"
    "  `from_date` date NOT NULL,"
    "  `to_date` date NOT NULL,"
    "  PRIMARY KEY (`emp_no`,`from_date`), KEY `emp_no` (`emp_no`)"    
    ") ENGINE=InnoDB")

TABLES['dept_emp'] = (
    "CREATE TABLE `dept_emp1` ("
    "  `emp_no` int(11) NOT NULL,"
    "  `dept_no` char(4) NOT NULL,"
    "  `from_date` date NOT NULL,"
    "  `to_date` date NOT NULL,"
    "  PRIMARY KEY (`emp_no`,`dept_no`), KEY `emp_no` (`emp_no`),"
    "  KEY `dept_no` (`dept_no`)"    
    ") ENGINE=InnoDB")

TABLES['dept_manager'] = (
    "  CREATE TABLE `dept_manager1` ("
    "  `emp_no` int(11) NOT NULL,"
    "  `dept_no` char(4) NOT NULL,"
    "  `from_date` date NOT NULL,"
    "  `to_date` date NOT NULL,"
    "  PRIMARY KEY (`emp_no`,`dept_no`),"
    "  KEY `emp_no` (`emp_no`),"
    "  KEY `dept_no` (`dept_no`)" 
    ") ENGINE=InnoDB")

TABLES['titles'] = (
    "CREATE TABLE `titles1` ("
    "  `emp_no` int(11) NOT NULL,"
    "  `title` varchar(50) NOT NULL,"
    "  `from_date` date NOT NULL,"
    "  `to_date` date DEFAULT NULL,"
    "  PRIMARY KEY (`emp_no`,`title`,`from_date`), KEY `emp_no` (`emp_no`)"   
    ") ENGINE=InnoDB")

- The preceding code shows how we are storing the CREATE statements in a Python dictionary called TABLES. We also define the database in a global variable called DB_NAME, which enables you to easily use a different schema.

In [305]:
cnx1 = connect(host="localhost",           
              user="Alem",               
              password="brookx150"
              )
cur = cnx1.cursor()

- A single MySQL server can manage multiple databases. Typically, you specify the database to switch to when connecting to the MySQL server. This example does not connect to the database upon connection, so that it can make sure the database exists, and create it if not:

In [306]:
def create_database(cur):
    try:
        cur.execute(
            "CREATE DATABASE {} DEFAULT CHARACTER SET 'utf8'".format(DB_NAME))
    except Error as err:
        print("Failed creating database: {}".format(err))
        exit(1)

try:
    cur.execute("USE {}".format(DB_NAME))
except Error as err:
    print("Database {} does not exists.".format(DB_NAME))
    if err.errno == errorcode.ER_BAD_DB_ERROR:
        create_database(cur)
        print("Database {} created successfully.".format(DB_NAME))
        cnx.database = DB_NAME
    else:
        print(err)
        exit(1)

Database employees does not exists.
1044 (42000): Access denied for user 'Alem'@'localhost' to database 'employees'

- We first try to change to a particular database using the database property of the connection object cnx. If there is an error, we examine the error number to check if the database does not exist. If so, we call the create_database function to create it for us.
- On any other error, the application exits and displays the error message.
- After we successfully create or change to the target database, we create the tables by iterating over the items of the TABLES dictionary:

In [298]:
for table_name in TABLES:
    table_description = TABLES[table_name]
    try:
        print("Creating table {}: ".format(table_name), end='')
        cur.execute(table_description)
    except mysql.connector.Error as err:
        if err.errno == errorcode.ER_TABLE_EXISTS_ERROR:
            print("already exists.")
        else:
            print(err.msg)
    else:
        print("OK")

cur.close()
cnx.close()

Creating table employees: OK
Creating table departments: OK
Creating table salaries: OK
Creating table dept_emp: OK
Creating table dept_manager: OK
Creating table titles: OK

In [299]:
config = {
  'user': 'Alem',
  'password': 'brookx150',
  'host': 'localhost',
  'database': 'alemdb',
  'raise_on_warnings': True
}

In [316]:
def create_tables(TABLES, config):
    conn = connect(**config)
    cur = conn.cursor()
    for table_name in TABLES:
        table_description = TABLES[table_name]
        try:
            print("Creating table {}: ".format(table_name), end='')
            cur.execute(table_description)
        except Error as err:
            if err.errno == errorcode.ER_TABLE_EXISTS_ERROR:
                print("Already exists.")
            else:
                print(err.msg)
        else:
            print("OK")

    cur.close()
    conn.close()

In [304]:
create_tables(TABLES, config)

Creating table employees: Already exists.
Creating table departments: Already exists.
Creating table salaries: Already exists.
Creating table dept_emp: Already exists.
Creating table dept_manager: Already exists.
Creating table titles: Already exists.

### 4.2 DROP DATABASE Statement
- Tip: Make sure you have admin privilege before dropping any database. Once a database is dropped, you can check it in the list of databases with the following SQL command: SHOW DATABASES;

        mysql> drop database testdb;
        Query OK, 0 rows affected (0.01 sec)

In [262]:
try:
    cdb = mydb1.cursor(buffered=True)
    sql = "DROP DATABASE testdb"
    cdb.execute(sql)
except:
    print(f"Err:{sys.exc_info()[0]}")

Err:<class 'mysql.connector.errors.ProgrammingError'>

### 4.3 CREATE TABLE Statement
- The CREATE TABLE statement is used to create a new table in a database.
- Syntax

        CREATE TABLE table_name (
            column1 datatype,
            column2 datatype,
            column3 datatype,
               ....
            );
            
       CREATE TABLE Persons (
            PersonID int,
            LastName varchar(255),
            FirstName varchar(255),
            Address varchar(255),
            City varchar(255)
       );
       
- Create Table Using Another Table
    - A copy of an existing table can also be created using CREATE TABLE.
    - Syntax

            CREATE TABLE new_table_name AS
                SELECT column1, column2,...
                FROM existing_table_name
                WHERE ....;

### 4.4 DROP TABLE Statement
- The DROP TABLE statement is used to drop an existing table in a database.
- Syntax

        DROP TABLE table_name;
        DROP TABLE IF EXISTS table_name;

### 4.5 ALTER TABLE Statement
- **ADD, DROP, & MODIFY**
- The ALTER TABLE statement is used to add, delete, or modify columns in an existing table.
- The ALTER TABLE statement is also used to add and drop various constraints on an existing table.
- ALTER TABLE - ADD Column
    - To add a column in a table, use the following syntax:

            ALTER TABLE table_name
            ADD column_name datatype;
- ALTER TABLE - DROP COLUMN
    - To delete a column in a table, use the following syntax (notice that some database systems don't allow deleting a column):

            ALTER TABLE table_name
            DROP COLUMN column_name;
            
- ALTER TABLE - MODIFY COLUMN
    - To change the data type of a column in a table, use the following syntax:

            ALTER TABLE table_name
            MODIFY COLUMN column_name datatype;

In [308]:
#!/usr/bin/python
from mysql.connector import connect
from mysql.connector import errorcode
import sys
try:
    conn = connect(
      host="localhost",           
      user="Alem",               
      password="brookx150",
      db = "alemdb"
    )    
except:
    print(f"Err:{sys.exc_info()[0]}")
else:
    print(f"Successfully connected to {mydb1}")

Successfully connected to <mysql.connector.connection_cext.CMySQLConnection object at 0x7f29b2f049d0>

In [311]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE alem"+\
      " ADD nc varchar(255)"
cur.execute(sql)

In [312]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE alem"+\
      " DROP nc"
cur.execute(sql)

In [314]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE alem"+\
      " MODIFY age TEXT"
cur.execute(sql)

In [315]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE alem"+\
      " MODIFY age INT"
cur.execute(sql)

### 4.6 Constraints
- SQL constraints are used to specify rules for data in a table.
- Create Constraints
    - Constraints can be specified when the table is created with the CREATE TABLE statement, or after the table is created with the **ALTER TABLE** statement.
- Syntax

        CREATE TABLE table_name (
            column1 datatype constraint,
            column2 datatype constraint,
            column3 datatype constraint,
        ....
        );
        
- SQL constraints are used to specify rules for the data in a table.
- Constraints are used to limit the type of data that can go into a table. This ensures the accuracy and reliability of the data in the table. If there is any violation between the constraint and the data action, the action is aborted.
- Constraints can be column level or table level. Column level constraints apply to a column, and table level constraints apply to the whole table.
- The following constraints are commonly used in SQL:
    - **NOT NULL** - Ensures that a column cannot have a NULL value
    - **UNIQUE** - Ensures that all values in a column are different
    - **PRIMARY KEY** - A combination of a NOT NULL and UNIQUE. Uniquely identifies each row in a table
    - **FOREIGN KEY** - Prevents actions that would destroy links between tables
    - **CHECK** - Ensures that the values in a column satisfies a specific condition
    - **DEFAULT** - Sets a default value for a column if no value is specified
    - **CREATE INDEX** - Used to create and retrieve data from the database very quickly

### 4.7 NOT NULL Constraint
- By default, a column can hold NULL values.
- The NOT NULL constraint enforces a column to NOT accept NULL values.
- This enforces a field to always contain a value, which means that you cannot insert a new record, or update a record without adding a value to this field.

In [318]:
TABLES = {}
TABLES['perosns'] = (
    "  CREATE TABLE `persons` ("
    "  `ID` int NOT NULL,"
    "  `LastName` varchar(255) NOT NULL,"
    "  `FirstName` varchar(255) NOT NULL,"
    "  `Age` int"    
    ") ENGINE=InnoDB")

create_tables(TABLES, config)

Creating table perosns: OK

In [319]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM persons"
cur.execute(sql)
for x in cur:
    print(x)

- NOT NULL on ALTER TABLE
    - To create a NOT NULL constraint on the "Age" column when the "Persons" table is already created, use the following SQL:
    - Example

            ALTER TABLE Persons
            MODIFY Age int NOT NULL;

In [321]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " MODIFY Age int NOT NULL"
cur.execute(sql)

### 4.8 UNIQUE Constraint
- The UNIQUE constraint ensures that all values in a column are different.
- Both the UNIQUE and PRIMARY KEY constraints provide a guarantee for uniqueness for a column or set of columns.
- A PRIMARY KEY constraint automatically has a UNIQUE constraint.
- However, you can have many UNIQUE constraints per table, but only one PRIMARY KEY constraint per table.
- UNIQUE Constraint on CREATE TABLE
    - The following SQL creates a UNIQUE constraint on the "ID" column when the "persons" table is created:

In [322]:
cur = conn.cursor(buffered=True)
sql = "DROP TABLE persons"
cur.execute(sql)

In [323]:
TABLES = {}
TABLES['perosns'] = (
    "  CREATE TABLE `persons` ("
    "  `ID` int NOT NULL,"
    "  `LastName` varchar(255) NOT NULL,"
    "  `FirstName` varchar(255) NOT NULL,"
    "  `Age` int,"
    "  UNIQUE (ID)"
    ") ENGINE=InnoDB")

create_tables(TABLES, config)

Creating table perosns: OK

- To name a UNIQUE constraint, and to define a UNIQUE constraint on multiple columns, use the following SQL syntax:

In [324]:
cur = conn.cursor(buffered=True)
sql = "DROP TABLE persons"
cur.execute(sql)

In [325]:
TABLES = {}
TABLES['perosns'] = (
    "  CREATE TABLE `persons` ("
    "  `ID` int NOT NULL,"
    "  `LastName` varchar(255) NOT NULL,"
    "  `FirstName` varchar(255),"
    "  `Age` int,"
    "  CONSTRAINT UC_Person UNIQUE (ID,LastName)"
    ") ENGINE=InnoDB")

create_tables(TABLES, config)

Creating table perosns: OK

In [326]:
cur = conn.cursor(buffered=True)
sql = "show columns from persons from alemdb"
cur.execute(sql)
for x in cur:
    print(x)

('ID', 'int(11)', 'NO', 'PRI', None, '')
('LastName', 'varchar(255)', 'NO', 'PRI', None, '')
('FirstName', 'varchar(255)', 'YES', '', None, '')
('Age', 'int(11)', 'YES', '', None, '')

- UNIQUE Constraint on ALTER TABLE
    - To create a UNIQUE constraint on the "ID" column when the table is already created, use the following SQL:

            ALTER TABLE Persons
            ADD UNIQUE (ID);
    - To name a UNIQUE constraint, and to define a UNIQUE constraint on multiple columns, use the following SQL syntax:
    
          ALTER TABLE Persons
          ADD CONSTRAINT UC_Person UNIQUE (ID,LastName);

In [327]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " ADD UNIQUE (ID)"
cur.execute(sql)

In [329]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " ADD CONSTRAINT UC_Person2 UNIQUE (ID,LastName)"
cur.execute(sql)

- DROP a UNIQUE Constraint
    - To drop a UNIQUE constraint, use the following SQL:

            ALTER TABLE Persons
            DROP INDEX UC_Person;

In [330]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " DROP INDEX UC_Person2"
cur.execute(sql)

In [331]:
cur = conn.cursor(buffered=True)
sql = "SHOW CREATE TABLE persons"
cur.execute(sql)
for y in cur:
    print(y)

('persons', 'CREATE TABLE `persons` (\n  `ID` int(11) NOT NULL,\n  `LastName` varchar(255) NOT NULL,\n  `FirstName` varchar(255) DEFAULT NULL,\n  `Age` int(11) DEFAULT NULL,\n  UNIQUE KEY `UC_Person` (`ID`,`LastName`),\n  UNIQUE KEY `ID` (`ID`)\n) ENGINE=InnoDB DEFAULT CHARSET=latin1')

### 4.9 PRIMARY KEY Constraint
- The PRIMARY KEY constraint uniquely identifies each record in a table.
- Primary keys must contain UNIQUE values, and cannot contain NULL values.
- A table can have only ONE primary key; and in the table, this primary key can consist of single or multiple columns (fields).
- PRIMARY KEY on CREATE TABLE
    - The following SQL creates a PRIMARY KEY on the "ID" column when the "Persons" table is created:

In [332]:
cur = conn.cursor(buffered=True)
sql = "DROP TABLE persons"
cur.execute(sql)

In [333]:
TABLES = {}
TABLES['perosns'] = (
    "  CREATE TABLE `persons` ("
    "  `ID` int NOT NULL,"
    "  `LastName` varchar(255) NOT NULL,"
    "  `FirstName` varchar(255),"
    "  `Age` int,"
    "  PRIMARY KEY (ID)"
    ") ENGINE=InnoDB")

create_tables(TABLES, config)

Creating table perosns: OK

- To allow naming of a PRIMARY KEY constraint, and for defining a PRIMARY KEY constraint on multiple columns, use the following SQL syntax:

In [334]:
cur = conn.cursor(buffered=True)
sql = "DROP TABLE persons"
cur.execute(sql)

In [335]:
TABLES = {}
TABLES['perosns'] = (
    "  CREATE TABLE `persons` ("
    "  `ID` int NOT NULL,"
    "  `LastName` varchar(255) NOT NULL,"
    "  `FirstName` varchar(255),"
    "  `Age` int,"
    "  CONSTRAINT PK_Person PRIMARY KEY (ID,LastName)"
    ") ENGINE=InnoDB")

create_tables(TABLES, config)

Creating table perosns: OK

- Note: In the example above there is only ONE PRIMARY KEY (PK_Person). However, the VALUE of the primary key is made up of TWO COLUMNS (ID + LastName).

In [336]:
cur = conn.cursor(buffered=True)
sql = "DROP TABLE persons"
cur.execute(sql)

- PRIMARY KEY on ALTER TABLE
    - To create a PRIMARY KEY constraint on the "ID" column when the table is already created, use the following SQL:

            ALTER TABLE Persons
            ADD PRIMARY KEY (ID);
    - To allow naming of a PRIMARY KEY constraint, and for defining a PRIMARY KEY constraint on multiple columns, use the following SQL syntax:

            ALTER TABLE Persons
            ADD CONSTRAINT PK_Person PRIMARY KEY (ID,LastName);
    - Note: If you use ALTER TABLE to add a primary key, the primary key column(s) must have been declared to not contain NULL values (when the table was first created).

In [339]:
TABLES = {}
TABLES['perosns'] = (
    "  CREATE TABLE `persons` ("
    "  `ID` int NOT NULL,"
    "  `LastName` varchar(255) NOT NULL,"
    "  `FirstName` varchar(255),"
    "  `Age` int"
    ") ENGINE=InnoDB")

create_tables(TABLES, config)

Creating table perosns: OK

In [341]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " ADD PRIMARY KEY (ID)"
cur.execute(sql)

In [346]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " DROP PRIMARY KEY"
cur.execute(sql)

In [348]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " ADD CONSTRAINT PK_Person PRIMARY KEY (ID,LastName)"
cur.execute(sql)

- DROP a PRIMARY KEY Constraint
    - To drop a PRIMARY KEY constraint, use the following SQL:

            ALTER TABLE Persons
            DROP PRIMARY KEY;

In [349]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " DROP PRIMARY KEY"
cur.execute(sql)

### 4.10 FOREIGN KEY Constraint
- The FOREIGN KEY constraint is used to prevent actions that would destroy links between tables.
- A FOREIGN KEY is a field (or collection of fields) in one table, that refers to the PRIMARY KEY in another table.
- The table with the foreign key is called the child table, and the table with the primary key is called the referenced or parent table.
- Look at the following two tables:

In [370]:
cur = conn.cursor(buffered=True)
sql = "DROP TABLE persons"
cur.execute(sql)

In [371]:
TABLES = {}
TABLES['perosns'] = (
    "  CREATE TABLE `persons` ("
    "  `personID` int NOT NULL,"
    "  `LastName` varchar(255) NOT NULL,"
    "  `FirstName` varchar(255),"
    "  `Age` int,"
    "  PRIMARY KEY(personID)"
    ") ENGINE=InnoDB")

create_tables(TABLES, config)

Creating table perosns: OK

In [372]:
sql = "INSERT INTO persons"+\
     " (personID, LastName, FirstName, age)"+\
     " VALUES (%s, %s, %s, %s)"
val = (1, 'Hansen', 'Ola', 30)
cur.execute(sql, val)
conn.commit()
print(cur.rowcount, "record inserted.")
print("1 record inserted, ID:", cur.lastrowid)

1 record inserted.
1 record inserted, ID: 0

In [373]:
sql = "INSERT INTO persons"+\
     " (personID, LastName, FirstName, age)"+\
     " VALUES (%s, %s, %s, %s)"
val = (2, 'Svendson', 'Tove', 23)
cur.execute(sql, val)
conn.commit()
print(cur.rowcount, "record inserted.")
print("1 record inserted, ID:", cur.lastrowid)

1 record inserted.
1 record inserted, ID: 0

In [374]:
sql = "INSERT INTO persons"+\
     " (personID, LastName, FirstName, age)"+\
     " VALUES (%s, %s, %s, %s)"
val = (3, 'Pettersen', 'Kari', 20)
cur.execute(sql, val)
conn.commit()
print(cur.rowcount, "record inserted.")
print("1 record inserted, ID:", cur.lastrowid)

1 record inserted.
1 record inserted, ID: 0

In [377]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM persons"
cur.execute(sql)
for x in cur:
    print(x)

(1, 'Hansen', 'Ola', 30)
(2, 'Svendson', 'Tove', 23)
(3, 'Pettersen', 'Kari', 20)

In [378]:
cur = conn.cursor(buffered=True)
sql = "SHOW CREATE TABLE persons"
cur.execute(sql)
for x in cur:
    print(x)

('persons', 'CREATE TABLE `persons` (\n  `personID` int(11) NOT NULL,\n  `LastName` varchar(255) NOT NULL,\n  `FirstName` varchar(255) DEFAULT NULL,\n  `Age` int(11) DEFAULT NULL,\n  PRIMARY KEY (`personID`)\n) ENGINE=InnoDB DEFAULT CHARSET=latin1')

In [376]:
TABLES = {}
TABLES['orders1'] = (
    "  CREATE TABLE `orders1` ("
    "  `orderID` int NOT NULL,"
    "  `orderNumber` int NOT NULL,"
    "  `personID` int,"
    "  PRIMARY KEY (orderID),"
    "  FOREIGN KEY (PersonID) REFERENCES Persons(PersonID)"
    ") ENGINE=InnoDB")

create_tables(TABLES, config)

Creating table orders1: Cannot add foreign key constraint

- To allow naming of a FOREIGN KEY constraint, and for defining a FOREIGN KEY constraint on multiple columns, use the following SQL syntax:

        CREATE TABLE Orders (
            OrderID int NOT NULL,
            OrderNumber int NOT NULL,
            PersonID int,
            PRIMARY KEY (OrderID),
            CONSTRAINT FK_PersonOrder FOREIGN KEY (PersonID)
            REFERENCES Persons(PersonID)
        );
        
- FOREIGN KEY on ALTER TABLE
    - To create a FOREIGN KEY constraint on the "PersonID" column when the "Orders" table is already created, use the following SQL:

            ALTER TABLE Orders
            ADD FOREIGN KEY (PersonID) REFERENCES Persons(PersonID);
    - To allow naming of a FOREIGN KEY constraint, and for defining a FOREIGN KEY constraint on multiple columns, use the following SQL syntax:

            ALTER TABLE Orders
            ADD CONSTRAINT FK_PersonOrder
            FOREIGN KEY (PersonID) REFERENCES Persons(PersonID);
            
- DROP a FOREIGN KEY Constraint
    - To drop a FOREIGN KEY constraint, use the following SQL:

            ALTER TABLE Orders
            DROP FOREIGN KEY FK_PersonOrder;

### 4.11 CHECK Constraint
- The CHECK constraint is used to limit the value range that can be placed in a column.
- If you define a CHECK constraint on a column it will allow only certain values for this column.
- If you define a CHECK constraint on a table it can limit the values in certain columns based on values in other columns in the row.
- CHECK on CREATE TABLE
    - The following SQL creates a CHECK constraint on the "Age" column when the "Persons" table is created. The CHECK constraint ensures that the age of a person must be 18, or older:

            CREATE TABLE Persons (
                ID int NOT NULL,
                LastName varchar(255) NOT NULL,
                FirstName varchar(255),
                Age int,
                CHECK (Age>=18)
            );
    - To allow naming of a CHECK constraint, and for defining a CHECK constraint on multiple columns, use the following SQL syntax:

            CREATE TABLE Persons (
                ID int NOT NULL,
                LastName varchar(255) NOT NULL,
                FirstName varchar(255),
                Age int,
                City varchar(255),
                CONSTRAINT CHK_Person CHECK (Age>=18 AND City='Sandnes')
);


- CHECK on ALTER TABLE
    - To create a CHECK constraint on the "Age" column when the table is already created, use the following SQL:

            ALTER TABLE Persons
            ADD CHECK (Age>=18);
    - To allow naming of a CHECK constraint, and for defining a CHECK constraint on multiple columns, use the following SQL syntax:

            ALTER TABLE Persons
            ADD CONSTRAINT CHK_PersonAge CHECK (Age>=18 AND City='Sandnes');
            
- DROP a CHECK Constraint
    - To drop a CHECK constraint, use the following SQL:

            ALTER TABLE Persons
            DROP CHECK CHK_PersonAge;

### 4.12 DEFAULT Constraint
- The DEFAULT constraint is used to set a default value for a column.
- The default value will be added to all new records, if no other value is specified.

- DEFAULT on CREATE TABLE
    - The following SQL sets a DEFAULT value for the "City" column when the "Persons" table is created:

            CREATE TABLE Persons (
                ID int NOT NULL,
                LastName varchar(255) NOT NULL,
                FirstName varchar(255),
                Age int,
                City varchar(255) DEFAULT 'Sandnes'
);

- The DEFAULT constraint can also be used to insert system values, by using functions like CURRENT_DATE():

        CREATE TABLE Orders (
            ID int NOT NULL,
            OrderNumber int NOT NULL,
            OrderDate date DEFAULT CURRENT_DATE()
);

- DEFAULT on ALTER TABLE
    - To create a DEFAULT constraint on the "City" column when the table is already created, use the following SQL:

            ALTER TABLE Persons
            ALTER City SET DEFAULT 'Sandnes';
- DROP a DEFAULT Constraint
    - To drop a DEFAULT constraint, use the following SQL:

            ALTER TABLE Persons
            ALTER City DROP DEFAULT;

### 4.13 CREATE INDEX Statement
- The CREATE INDEX statement is used to create indexes in tables.
- Indexes are used to retrieve data from the database more quickly than otherwise. The users cannot see the indexes, they are just used to speed up searches/queries.
- Note: Updating a table with indexes takes more time than updating a table without (because the indexes also need an update). So, only create indexes on columns that will be frequently searched against.
- CREATE INDEX Syntax
    - Creates an index on a table. Duplicate values are allowed:

            CREATE INDEX index_name
            ON table_name (column1, column2, ...);

- The SQL statement below creates an index named "idx_lastname" on the "LastName" column in the "Persons" table:

        CREATE INDEX idx_lastname
        ON Persons (LastName);
- If you want to create an index on a combination of columns, you can list the column names within the parentheses, separated by commas:

        CREATE INDEX idx_pname
        ON Persons (LastName, FirstName);

In [389]:
cur = conn.cursor(buffered=True)
sql = "CREATE INDEX idx_pname"+\
      " ON persons (LastName, FirstName)"
cur.execute(sql)

In [390]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM persons"
cur.execute(sql)
for x in cur:
    print(x)

(1, 'Hansen', 'Ola', 30)
(2, 'Svendson', 'Tove', 23)
(3, 'Pettersen', 'Kari', 20)

- DROP INDEX Statement
    - The DROP INDEX statement is used to delete an index in a table.

            ALTER TABLE table_name
            DROP INDEX index_name;

In [391]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " DROP INDEX idx_pname"
cur.execute(sql)

### 4.14 AUTO INCREMENT Field
- Auto-increment allows a unique number to be generated automatically when a new record is inserted into a table.
- Often this is the primary key field that we would like to be created automatically every time a new record is inserted.
- MySQL AUTO_INCREMENT Keyword
    - MySQL uses the AUTO_INCREMENT keyword to perform an auto-increment feature.
    - By default, the starting value for AUTO_INCREMENT is 1, and it will increment by 1 for each new record.
    - The following SQL statement defines the "Personid" column to be an auto-increment primary key field in the "Persons" table:

In [392]:
cur = conn.cursor(buffered=True)
sql = "DROP TABLE persons"
cur.execute(sql)

In [393]:
TABLES = {}
TABLES['perosns'] = (
    "  CREATE TABLE `persons` ("
    "  `personID` int NOT NULL AUTO_INCREMENT,"
    "  `LastName` varchar(255) NOT NULL,"
    "  `FirstName` varchar(255),"
    "  `Age` int,"
    "  PRIMARY KEY(personID)"
    ") ENGINE=InnoDB")

create_tables(TABLES, config)

Creating table perosns: OK

In [394]:
sql = "INSERT INTO persons"+\
     " (personID, LastName, FirstName, age)"+\
     " VALUES (%s, %s, %s, %s)"
val = (1, 'Hansen', 'Ola', 30)
cur.execute(sql, val)
conn.commit()
print(cur.rowcount, "record inserted.")
print("1 record inserted, ID:", cur.lastrowid)
      
sql = "INSERT INTO persons"+\
     " (personID, LastName, FirstName, age)"+\
     " VALUES (%s, %s, %s, %s)"
val = (2, 'Svendson', 'Tove', 23)
cur.execute(sql, val)
conn.commit()
print(cur.rowcount, "record inserted.")
print("1 record inserted, ID:", cur.lastrowid)

sql = "INSERT INTO persons"+\
     " (personID, LastName, FirstName, age)"+\
     " VALUES (%s, %s, %s, %s)"
val = (3, 'Pettersen', 'Kari', 20)
cur.execute(sql, val)
conn.commit()
print(cur.rowcount, "record inserted.")
print("1 record inserted, ID:", cur.lastrowid)

1 record inserted.
1 record inserted, ID: 1
1 record inserted.
1 record inserted, ID: 2
1 record inserted.
1 record inserted, ID: 3

In [396]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM persons"
cur.execute(sql)
for x in cur:
    print(x)

(1, 'Hansen', 'Ola', 30)
(2, 'Svendson', 'Tove', 23)
(3, 'Pettersen', 'Kari', 20)

- To let the AUTO_INCREMENT sequence start with another value, use the following SQL statement:

        ALTER TABLE Persons AUTO_INCREMENT=100;
- When we insert a new record into the "Persons" table, we do NOT have to specify a value for the "Personid" column (a unique value will be added automatically):

        INSERT INTO Persons (FirstName,LastName)
        VALUES ('Lars','Monsen');
- The SQL statement above would insert a new record into the "Persons" table. The "Personid" column would be assigned a unique value automatically. The "FirstName" column would be set to "Lars" and the "LastName" column would be set to "Monsen".

In [398]:
sql = "INSERT INTO persons (FirstName,LastName)"+\
      " VALUES ('Lars','Monsen')"
cur.execute(sql)
conn.commit()
print(cur.rowcount, "record inserted.")
print("1 record inserted, ID:", cur.lastrowid)

1 record inserted.
1 record inserted, ID: 4

In [399]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM persons"
cur.execute(sql)
for x in cur:
    print(x)

(1, 'Hansen', 'Ola', 30)
(2, 'Svendson', 'Tove', 23)
(3, 'Pettersen', 'Kari', 20)
(4, 'Monsen', 'Lars', None)

### 4.15 Working With Dates
- The most difficult part when working with dates is to be sure that the format of the date you are trying to insert, matches the format of the date column in the database.
- As long as your data contains only the date portion, your queries will work as expected. However, if a time portion is involved, it gets more complicated.

#### MySQL Date Data Types
- MySQL comes with the following data types for storing a date or a date/time value in the database:

            DATE - format YYYY-MM-DD
            DATETIME - format: YYYY-MM-DD HH:MI:SS
            TIMESTAMP - format: YYYY-MM-DD HH:MI:SS
            YEAR - format YYYY or YY
- Note: The date data type are set for a column when you create a new table in your database!

In [401]:
cur = conn.cursor(buffered=True)
sql = "ALTER TABLE persons"+\
      " ADD orderdate date"
cur.execute(sql)

In [402]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM persons"
cur.execute(sql)
for x in cur:
    print(x)

(1, 'Hansen', 'Ola', 30, None)
(2, 'Svendson', 'Tove', 23, None)
(3, 'Pettersen', 'Kari', 20, None)
(4, 'Monsen', 'Lars', None, None)

In [ ]:
mycursor15 = mydb.cursor(buffered=True)
sql = "UPDATE alem SET age = 40 WHERE name = 'Alem'"
mycursor15.execute(sql)
mydb.commit()
print(mycursor15.rowcount, "record(s) affected")

In [407]:
sql = "UPDATE persons SET orderdate = '2008-11-11'"+\
      " WHERE personID =1"
cur.execute(sql)
conn.commit()
print(cur.rowcount, "record(s) affected")

1 record(s) affected

In [408]:
sql = "UPDATE persons SET orderdate = '2008-11-09'"+\
      " WHERE personID =2"
cur.execute(sql)
conn.commit()
print(cur.rowcount, "record(s) affected")

1 record(s) affected

In [409]:
sql = "UPDATE persons SET orderdate = '2008-11-11'"+\
      " WHERE personID =3"
cur.execute(sql)
conn.commit()
print(cur.rowcount, "record(s) affected")

1 record(s) affected

In [410]:
sql = "UPDATE persons SET orderdate = '2008-10-29'"+\
      " WHERE personID =4"
cur.execute(sql)
conn.commit()
print(cur.rowcount, "record(s) affected")

1 record(s) affected

In [411]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM persons"
cur.execute(sql)
for x in cur:
    print(x)

(1, 'Hansen', 'Ola', 30, datetime.date(2008, 11, 11))
(2, 'Svendson', 'Tove', 23, datetime.date(2008, 11, 9))
(3, 'Pettersen', 'Kari', 20, datetime.date(2008, 11, 11))
(4, 'Monsen', 'Lars', None, datetime.date(2008, 10, 29))

- Now we want to select the records with an OrderDate of "2008-11-11" from the table above.
- We use the following SELECT statement:

In [414]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM persons WHERE orderdate='2008-11-11'"
cur.execute(sql)
for x in cur:
    print(x)

(1, 'Hansen', 'Ola', 30, datetime.date(2008, 11, 11))
(3, 'Pettersen', 'Kari', 20, datetime.date(2008, 11, 11))

- Note: Two dates can easily be compared if there is no time component involved!
- Now, assume that the "Orders" table looks like this (notice the added time-component in the "OrderDate" column):

In [415]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM persons"
cur.execute(sql)
for x in cur:
    print(x)

(1, 'Hansen', 'Ola', 30, datetime.date(2008, 11, 11))
(2, 'Svendson', 'Tove', 23, datetime.date(2008, 11, 9))
(3, 'Pettersen', 'Kari', 20, datetime.date(2008, 11, 11))
(4, 'Monsen', 'Lars', None, datetime.date(2008, 10, 29))

- Tip: To keep your queries simple and easy to maintain, do not use time-components in your dates, unless you have to!

### 4.16 Views
#### MySQL CREATE VIEW Statement
- In SQL, a view is a virtual table based on the result-set of an SQL statement.
- A view contains rows and columns, just like a real table. The fields in a view are fields from one or more real tables in the database.
- You can add SQL statements and functions to a view and present the data as if the data were coming from one single table.
- A view is created with the CREATE VIEW statement.
- CREATE VIEW Syntax

        CREATE VIEW view_name AS
        SELECT column1, column2, ...
        FROM table_name
        WHERE condition;
        
- Note: A view always shows up-to-date data! The database engine recreates the view, every time a user queries it.

In [ ]:
cur = conn.cursor(buffered=True)
sql = "CREATE VIEW viewv AS"+\
      " SELECT * FROM persons"+\
      " WHERE orderdate='2008-11-11'"
cur.execute(sql)

In [419]:
cur = conn.cursor(buffered=True)
sql = "SELECT * FROM viewv"
cur.execute(sql)
for x in cur:
    print(x)

(1, 'Hansen', 'Ola', 30, datetime.date(2008, 11, 11))
(3, 'Pettersen', 'Kari', 20, datetime.date(2008, 11, 11))

#### Updating a View
- A view can be updated with the CREATE OR REPLACE VIEW statement.
- CREATE OR REPLACE VIEW Syntax
        
        CREATE OR REPLACE VIEW view_name AS
        SELECT column1, column2, ...
        FROM table_name
        WHERE condition;
- The following SQL adds the "City" column to the viewv view:

        CREATE OR REPLACE VIEW viewv AS
        SELECT CustomerName, ContactName, City
        FROM Customers
        WHERE Country = 'Brazil';

#### MySQL Dropping a View
- A view is deleted with the DROP VIEW statement.

        DROP VIEW Syntax
        DROP VIEW view_name;
- The following SQL drops the "Brazil Customers" view:

        DROP VIEW [Brazil Customers];

In [420]:
sql = "DROP VIEW viewv"
cur.execute(sql)
conn.commit()
print(cur.rowcount, "record(s) affected")

0 record(s) affected

### 4.18 MySQL Data Types
- The data type of a column defines what value the column can hold: integer, character, money, date and time, binary, and so on.

#### MySQL Data Types (Version 8.0)
- Each column in a database table is required to have a name and a data type.
- An SQL developer must decide what type of data that will be stored inside each column when creating a table. The data type is a guideline for SQL to understand what type of data is expected inside of each column, and it also identifies how SQL will interact with the stored data.
- In MySQL there are three main data types: string, numeric, and date and time.

##### String Data Types
|Data type	|Description|
|---|---|
|CHAR(size)	|A FIXED length string (can contain letters, numbers, and special characters). The size parameter specifies the column length in characters - can be from 0 to 255. Default is 1|
|VARCHAR(size)	|A VARIABLE length string (can contain letters, numbers, and special characters). The size parameter specifies the maximum column length in characters - can be from 0 to 65535|
|BINARY(size)	|Equal to CHAR(), but stores binary byte strings. The size parameter specifies the column length in bytes. Default is 1|
|VARBINARY(size)	|Equal to VARCHAR(), but stores binary byte strings. The size parameter specifies the maximum column length in bytes.|
|TINYBLOB	|For BLOBs (Binary Large OBjects). Max length: 255 bytes|
|TINYTEXT	|Holds a string with a maximum length of 255 characters|
|TEXT(size)	|Holds a string with a maximum length of 65,535 bytes|
|BLOB(size)	|For BLOBs (Binary Large OBjects). Holds up to 65,535 bytes of data|
|MEDIUMTEXT	|Holds a string with a maximum length of 16,777,215 characters|
|MEDIUMBLOB	|For BLOBs (Binary Large OBjects). Holds up to 16,777,215 bytes of data|
|LONGTEXT	|Holds a string with a maximum length of 4,294,967,295 characters|
|LONGBLOB	|For BLOBs (Binary Large OBjects). Holds up to 4,294,967,295 bytes of data|
|ENUM(val1, val2, val3, ...)	|A string object that can have only one value, chosen from a list of possible values. You can list up to 65535 values in an ENUM list. If a value is inserted that is not in the list, a blank value will be inserted. The values are sorted in the order you enter them|
|SET(val1, val2, val3, ...)	|A string object that can have 0 or more values, chosen from a list of possible values. You can list up to 64 values in a SET list|

##### Numeric Data Types
|Data type	|Description|
|---|---|
BIT(size)	A bit-value type. The number of bits per value is specified in size. The size parameter can hold a value from 1 to 64. The default value for size is 1.
TINYINT(size)	A very small integer. Signed range is from -128 to 127. Unsigned range is from 0 to 255. The size parameter specifies the maximum display width (which is 255)
BOOL	Zero is considered as false, nonzero values are considered as true.
BOOLEAN	Equal to BOOL
SMALLINT(size)	A small integer. Signed range is from -32768 to 32767. Unsigned range is from 0 to 65535. The size parameter specifies the maximum display width (which is 255)
MEDIUMINT(size)	A medium integer. Signed range is from -8388608 to 8388607. Unsigned range is from 0 to 16777215. The size parameter specifies the maximum display width (which is 255)
INT(size)	A medium integer. Signed range is from -2147483648 to 2147483647. Unsigned range is from 0 to 4294967295. The size parameter specifies the maximum display width (which is 255)
INTEGER(size)	Equal to INT(size)
BIGINT(size)	A large integer. Signed range is from -9223372036854775808 to 9223372036854775807. Unsigned range is from 0 to 18446744073709551615. The size parameter specifies the maximum display width (which is 255)
FLOAT(size, d)	A floating point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. This syntax is deprecated in MySQL 8.0.17, and it will be removed in future MySQL versions
FLOAT(p)	A floating point number. MySQL uses the p value to determine whether to use FLOAT or DOUBLE for the resulting data type. If p is from 0 to 24, the data type becomes FLOAT(). If p is from 25 to 53, the data type becomes DOUBLE()
DOUBLE(size, d)	A normal-size floating point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter
DOUBLE PRECISION(size, d)	 
DECIMAL(size, d)	An exact fixed-point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. The maximum number for size is 65. The maximum number for d is 30. The default value for size is 10. The default value for d is 0.
DEC(size, d)	Equal to DECIMAL(size,d)

- Note: All the numeric data types may have an extra option: UNSIGNED or ZEROFILL. If you add the UNSIGNED option, MySQL disallows negative values for the column. If you add the ZEROFILL option, MySQL automatically also adds the UNSIGNED attribute to the column.

##### Date and Time Data Types
|Data type	|Description|
|---|---|
|DATE	|A date. Format: YYYY-MM-DD. The supported range is from '1000-01-01' to '9999-12-31'|
|DATETIME(fsp)	|A date and time combination. Format: YYYY-MM-DD hh:mm:ss. The supported range is from '1000-01-01 00:00:00' to '9999-12-31 23:59:59'. Adding DEFAULT and ON UPDATE in the column definition to get automatic initialization and updating to the current date and time|
|TIMESTAMP(fsp)	|A timestamp. TIMESTAMP values are stored as the number of seconds since the Unix epoch ('1970-01-01 00:00:00' UTC). Format: YYYY-MM-DD hh:mm:ss. The supported range is from '1970-01-01 00:00:01' UTC to '2038-01-09 03:14:07' UTC. Automatic initialization and updating to the current date and time can be specified using DEFAULT CURRENT_TIMESTAMP and ON UPDATE CURRENT_TIMESTAMP in the column definition|
|TIME(fsp)	|A time. Format: hh:mm:ss. The supported range is from '-838:59:59' to '838:59:59'|
|YEAR	|A year in four-digit format. Values allowed in four-digit format: 1901 to 2155, and 0000. MySQL 8.0 does not support year in two-digit format.|

### 4.19 MySQL Functions
- MySQL has many built-in functions. This reference contains string, numeric, date, and some advanced functions in MySQL.

https://www.w3schools.com/mySQl/mysql_ref_functions.asp

#### MySQL String Functions
|Function	|Description|
|---|---|
ASCII	|Returns the ASCII value for the specific character|
CHAR_LENGTH	|Returns the length of a string (in characters)|
CHARACTER_LENGTH	|Returns the length of a string (in characters)|
CONCAT	|Adds two or more expressions together|
CONCAT_WS	|Adds two or more expressions together with a separator|
FIELD	|Returns the index position of a value in a list of values|
FIND_IN_SET	|Returns the position of a string within a list of strings|
FORMAT	|Formats a number to a format like "#,###,###.##", rounded to a specified number of decimal places|
INSERT	|Inserts a string within a string at the specified position and for a certain number of characters|
INSTR	|Returns the position of the first occurrence of a string in another string|
LCASE	|Converts a string to lower-case|
LEFT	|Extracts a number of characters from a string (starting from left)|
LENGTH	|Returns the length of a string (in bytes)|
LOCATE	|Returns the position of the first occurrence of a substring in a string|
LOWER	|Converts a string to lower-case|
LPAD	|Left-pads a string with another string, to a certain length|
LTRIM	|Removes leading spaces from a string|
MID	|Extracts a substring from a string (starting at any position)|
POSITION	|Returns the position of the first occurrence of a substring in a string|
REPEAT	|Repeats a string as many times as specified|
REPLACE	|Replaces all occurrences of a substring within a string, with a new substring|
REVERSE	|Reverses a string and returns the result|
RIGHT	|Extracts a number of characters from a string (starting from right)|
RPAD	|Right-pads a string with another string, to a certain length|
RTRIM	|Removes trailing spaces from a string|
SPACE	|Returns a string of the specified number of space characters|
STRCMP	|Compares two strings|
SUBSTR	|Extracts a substring from a string (starting at any position)|
SUBSTRING	|Extracts a substring from a string (starting at any position)|
SUBSTRING_INDEX	|Returns a substring of a string before a specified number of delimiter occurs|
TRIM	|Removes leading and trailing spaces from a string|
UCASE	|Converts a string to upper-case|
UPPER	|Converts a string to upper-case|

#### MySQL Numeric Functions

#### MySQL Date Functions

#### MySQL Advanced Functions

### 4.20 WITH
Common Table Expressions